[
  {
    "Author": "Rashid Khalidi ",
    "Book_Name": "The Hundred Years' War on Palestine: A History of Settler Colonialism and Resistance, 1917-2017",
    "Book_Image": "https://images-us.bookshop.org/ingram/9781250787651.jpg?height=500&v=v2",
    "Product_Details": [
      {
        "Availability_Status": "InStock",
        "Price": [
          {
            "Primary_Price": "$19.99 ",
            "Discounted_Price": "$18.59"
          }
        ],
        "Publisher": "Picador USA",
        "Date_Published": "January 26, 2021",
        "Pages": "336",
        "Dimensions": "5.3 X 8.2 X 1.0 inches | 0.64 pounds",
        "Language": "English",
        "Format": "Paperback",
        "EAN_UPC_Code": "9781250787651"
      },
      {
        "Availability_Status": "BackOrder",
        "Price": [
          {
            "Primary_Price": "$30.00 ",
            "Discounted_Price": "$27.90"
          }
        ],
        "Publisher": "Metropolitan Books",
        "Date_Published": "January 28, 2020",
        "Pages": "336",
        "Dimensions": "6.3 X 9.6 X 1.2 inches | 1.15 pounds",
        "Language": "English",
        "Format": "Hardcover",
        "EAN_UPC_Code": "9781627798556"
      }
    ],
    "Description": "A landmark history of one hundred years of war waged against the Palestinians from the foremost US historian of the Middle East, told through pivotal events and family history\n\nIn 1899, Yusuf Diya al-Khalidi, mayor of Jerusalem, alarmed by the Zionist call to create a Jewish national home in Palestine, wrote a letter aimed at Theodore Herzl: the country had an indigenous people who would not easily accept their own displacement. He warned of the perils ahead, ending his note, \"in the name of God, let Palestine be left alone.\" Thus Rashid Khalidi, al-Khalidi's great-great-nephew, begins this sweeping history, the first general account of the conflict told from an explicitly Palestinian perspective.\n\nDrawing on a wealth of untapped archival materials and the reports of generations of family members--mayors, judges, scholars, diplomats, and journalists--The Hundred Years' War on Palestine upends accepted interpretations of the conflict, which tend, at best, to describe a tragic clash between two peoples with claims to the same territory. Instead, Khalidi traces a hundred years of colonial war on the Palestinians, waged first by the Zionist movement and then Israel, but backed by Britain and the United States, the great powers of the age. He highlights the key episodes in this colonial campaign, from the 1917 Balfour Declaration to the destruction of Palestine in 1948, from Israel's 1982 invasion of Lebanon to the endless and futile peace process.\n\nOriginal, authoritative, and important, The Hundred Years' War on Palestine is not a chronicle of victimization, nor does it whitewash the mistakes of Palestinian leaders or deny the emergence of national movements on both sides. In reevaluating the forces arrayed against the Palestinians, it offers an illuminating new view of a conflict that continues to this day.",
    "BISAC_Categories": [
      "Middle East - Israel & Palestine",
      "World - Middle Eastern",
      "Colonialism & Post-Colonialism"
    ],
    "About_Author": "Rashid Khalidi is the author of Palestinian Identity, Brokers of Deceit, and The Iron Cage, among others. His writing has appeared in the New York Times, Boston Globe, Los Angeles Times, Chicago Tribune, and many other journals. He is the Edward Said Professor of Modern Arab Studies at Columbia University in New York and editor of the Journal of Palestine Studies",
    "Reviews": [
      "\"Informed and passionate . . . Khalidi's is an elegy for the Palestinians, for their dispossession, for their failure to resist conquest.\"",
      "--The Guardian",
      "",
      "\"The Hundred Years' War is one of the best-researched general surveys of 20th and early 21st century Palestinian life, but it's also a deeply personal work. . . . For a people whose history is all but criminalized, this act of retelling is itself a form of resistance.\"",
      "--The Nation",
      "",
      "\"Rigorous and lucid . . . Rashid Khalidi, the intellectual heir to Edward Said, has written one of the great books on the Israeli-Palestinian question.\"",
      "--Financial Times",
      "",
      "\"A book of witnessed historical accounts and enlightening deep analysis . . . each chapter is rich with revelations . . . I doubt if my experience of reading this great intellectual contribution could have been any more enriching.\"",
      "--Mondoweiss",
      "",
      "\"Masterful . . . brilliant . . . This major work will occupy a central position in the literature of Palestinian history.\"",
      "--Al-Quds",
      "",
      "\"After decades of scrupulous objectivity, Khalidi has now written a very personal book. . . . The Hundred Years' War on Palestine is a roller-coaster ride through Palestinian history, one hundred years without a moment of solitude.\"",
      "--The Baffler",
      "",
      "\"For those who want to learn about the course of the Israel-Palestine conflict up till now, and are open-minded: read this book. It comes over as a brilliant synthesis of high scholarship and experience, fair-minded, and highly readable.\"",
      "--Jacobin",
      "",
      "\"Meticulous . . . Rashid Khalidi's exhaustive research leaves no doubt that the Jewish colonizers were acutely aware from the start that the Palestinian people had to be subjugated and removed to create the Jewish state.\"",
      "--Chris Hedges, TruthDig",
      "",
      "\"This book is a masterful work of scholarship and personal history excavating unlike any I've seen before; this will become a major force in the Palestinian historical canon in the years to come.\"",
      "--Literary Hub",
      "",
      "\"This book's undertaking is remarkable: renowned historian Khalidi captures over a century of history in strong, compelling prose, including that of his own family (his great-great-great-uncle was the mayor of Jerusalem in the late 19th-century). It is widely considered required reading for anyone truly wishing to understand Palestine.\"",
      "--Electric Literature",
      "",
      "\"A richly informed, personalized account of a century of repression of a peoples' national aspirations. . . . original and distinctive . . . a remarkable testament to the stubborn resistance that characterizes the Palestinians.\"",
      "--Washington Report on Middle East Affairs",
      "",
      "\"Riveting and original . . . Khalidi skillfully balances his professional analysis of historical and diplomatic documents with insights of his own and his relatives who had leadership roles throughout the twentieth century. . . . A profoundly moving account.\"",
      "--Hespéris-Tamuda",
      "",
      "\"Heart-wrenching . . . powerful . . . brave . . . The Hundred Years' War on Palestine is a valuable violation of the taboo against injecting personal narrative into historical accounts. . . .Though it is difficult to look to the future with any degree of optimism, Khalidi manages to find hopeful signs of the growing international support for Palestinian rights.\"",
      "--Weekly Worker",
      "",
      "\"The Hundred Years' War on Palestine is lived history, a testament not only to what Palestinians experienced as a collective but also to what this meant in very immediate ways to the author himself. . . . Khalidi's personal stories make an already tragic history even more poignant.\"",
      "--Portside",
      "",
      "\"Rashid Khalidi has written a remarkable book. . . . The personal anecdotes add flavour and analytical depth to the historical narrative. . . . Khalidi discusses Palestinian errors with a deep sincerity, while emphasizing how the cards have been greatly stacked to their disadvantage.\"",
      "--Journal of Peace Research",
      "",
      "\"Dogged . . . a timely, cogent, patient history of a seemingly intractable conflict told from a learned Palestinian perspective.\"",
      "--Kirkus",
      "",
      "\"Khalidi skillfully balances analysis of historical and diplomatic documents with insights of his own and his relatives who had leadership roles throughout the 20th century . . . Highly recommended.\"",
      "--Library Journal",
      "",
      "\"The Hundred Years' War on Palestine presents a vital perspective on one of the planet's most intractable geopolitical and humanitarian crises.\"",
      "--Shelf Awareness (starred review)",
      "",
      "\"One of the many merits of the book is the way Khalidi uses his family and his own life experience to tell this tragic, yet-to-be-righted, story. . . . While his condemnation of Israel's policies and historic Zionism is unrelenting, Khalidi has straight talk for the Palestinians on the question of compromises.\"",
      "--Balfour Project",
      "",
      "\"Rashid Khalidi enjoys a well-deserved reputation as one of the greatest living historians of the Palestinian people. . . . Khalidi is a sophisticated and unapologetic exponent of an increasingly widely held view of the Israel-Palestine conflict.\"",
      "--The Literary Review (UK)",
      "",
      "\"A superb, no-holds-barred history of the Palestinian struggle for liberation . . . Rashid Khalidi pulls no punches in criticizing the abject failings of both global and domestic politicians who have helped perpetuate the continued misery in Palestine.\"",
      "--Morning Star (UK)",
      "",
      "\"Focused on the Palestinians' lived experience of a century of war, never losing sight of the geo-political forces that fostered it, Rashid Khalidi has written a book of comprehensive scholarship with the delicacy and intensity of a novel.\"",
      "--Ahdaf Soueif, author of The Map of Love",
      "",
      "\"With wisdom and insight, Rashid Khalidi lays to rest the illusions of Israelis and Palestinians alike. He combines brilliant scholarship with extensive first-hand experience of war and diplomacy in a call for mutual acceptance and equality of rights as the only way to end a century of conflict. An outstanding book.\"",
      "--Eugene Rogan, author of The Arabs: A History",
      "",
      "\"A riveting and original work, the first to explore the century of war against the Palestinians on the basis of deep immersion in their struggle--a work enriched by solid scholarship, vivid personal experience, and acute appreciation of the concerns and aspirations of the contending parties in this deeply unequal conflict.\"",
      "--Noam Chomsky, author of Failed States: The Abuse of Power and the Assault on Democracy",
      "",
      "\"Brave, brilliant, and magisterial, this outstanding work of historical scholarship is also full of high drama and fascinating narrative. Rashid Khalidi presents compelling evidence for a reevaluation of the conventional Western view of the subject in a book that is a milestone in the study of the Arab-Israeli conflict.\"",
      "--Avi Shlaim, author of The Iron Wall: Israel and the Arab World",
      "",
      "\"This is the first true people's history of the hundred-year struggle of the Palestinian people, a beautifully written text and a call for justice and self-determination.\"",
      "--Roxanne Dunbar-Ortiz, author of An Indigenous Peoples' History of the United States",
      "",
      "\"A meticulous account of Palestinian history that provides a brilliant framework for the study of settler colonialism on a global scale. You can disagree with Khalidi but you cannot afford to miss the opportunity of arguing with him.\"",
      "--Homi K. Bhabha, author of The Location of Culture",
      "",
      "\"Through a scholarly narrative rooted in his own family history, Rashid Khalidi offers a fresh interpretation that shows Palestine as a violent, grinding fault in the shifting tectonic plates of Great Power politics. This book is sure to become a classic account.\"",
      "--Elizabeth F. Thompson, author of Justice Interrupted: The Struggle for Constitutional Government in the Middle East",
      "",
      "\"This book is a remarkable interweaving of three distinctive strands: a deeply researched history of the struggle between Zionist aspirations and Palestinian resistance; an analytical framework that places the conflict within the context of settler colonialism; and a personal family history that brings the narrative alive. Newcomers and specialists alike will learn much from reading this sweeping account.\"",
      "--William B. Quandt, author of Peace Process: American Diplomacy and the Arab-Israeli Conflict Since 1967",
      "",
      "\"Learned and clear-eyed, this compelling history of the long war to deny Palestinian rights exposes a century of blunders, misjudgments, and willful deceptions. Highly recommended.\"",
      "--Stephen M. Walt, coauthor of The Israel Lobby",
      "",
      "\"Beautifully written and accessible, this book is an invaluable examination of the Palestinian-Zionist encounter as a struggle against settler-colonial domination, not as an issue of conflict resolution--a vital difference, necessary for a deeper understanding of the war and for its meaningful resolution. The Hundred Years' War on Palestine illustrates, at its core, the refusal of Palestinians to accept their own defeat and their desire to live as equals with Israelis in a land they are destined to share.\"",
      "--Sara Roy, author of Hamas and Civil Society in Gaza: Engaging the Islamist Social Sector",
      "",
      "\"As in any book about the Israeli-Palestinian conflict, there is ample room for debate and controversy. And as in any book by Rashid Khalidi, there is history, erudition, politics and passion aplenty. There is also his tenacious conviction that 'there are now two peoples in Palestine, irrespective of how they came into being, and the conflict between them cannot be resolved as long as the national existence of each is denied by the other.'\"",
      "--Rob Malley, International Crisis Group CEO and White House Coordinator for the Middle East under President Barack Obama",
      "",
      "\"Rashid Khalidi makes clear that the Zionists could not have created modern day Israel without abundant help from Britain and the United States. A must read for the growing number of people who are interested in understanding the real roots of the Israeli-Palestinian conflict.\"",
      "--John J. Mearsheimer, coauthor of The Israel Lobby",
      "",
      "\"With moral passion and analytical rigor, Khalidi skillfully unearths the narrative of a long and bitter national conflict, providing a multitude of timely, acute, and original insights. This compelling book is a must read.\"",
      "--Zeev Sternhell, author of The Anti-Enlightenment Tradition",
      "",
      "\"In a painfully sober analysis of what made Zionism, an anachronistic colonialist enterprise, so successful, Rashid Khalidi also shows how Palestinians defy fatalism and refuse to vanish. His book is a tribute and contribution to his people's perseverance.\"",
      "--Amira Hass, author of Drinking the Sea at Gaza",
      "",
      "\"This fascinating and instructive blend of autobiography and history should be read by anybody who wants to understand the tragedy of Palestine and the Palestinians.\"",
      "--Patrick Cockburn, author of The Rise of the Islamic State",
      "",
      "\"Rashid Khalidi has produced a sophisticated and insightful historical analysis of the Palestine-Israel conflict that is enriched by deep knowledge, clear and critical views, and his own experiences of key moments.\"",
      "--Ian Black, author of Enemies and Neighbors: Arabs and Jews in Palestine and Israel, 1917-2017",
      "",
      "\"This searing account makes clearer than ever the often deliberately understated colonial nature of the Palestinian experience--and it reminds us of the Palestinians' extraordinary capacity to remain steadfast despite the local and global forces arrayed against them.\"",
      "--Saree Makdisi, author of Palestine Inside Out: An Everyday Occupation of Culture"
    ]
  },
  {
    "Author": "Bex Ahuja ",
    "Book_Name": "Management in a Changing World: How to Manage for Equity, Sustainability, and Results",
    "Book_Image": "https://images-us.bookshop.org/ingram/9781394165797.jpg?height=500&v=v2-0132c2fff4f22d66fb6900dd00000000",
    "Product_Details": [
      {
        "Availability_Status": "InStock",
        "Price": [
          {
            "Primary_Price": "$32.00 ",
            "Discounted_Price": "$29.76"
          }
        ],
        "Publisher": "Wiley",
        "Date_Published": "May 16, 2023",
        "Pages": "256",
        "Dimensions": "7.42 X 9.22 X 0.7 inches | 0.81 pounds",
        "Language": "English",
        "Format": "Paperback",
        "EAN_UPC_Code": "9781394165797"
      }
    ],
    "Description": "Magnify your real-world impact as you lead others in a social change organization\n\nIn Management In a Changing World: How to Manage for Equity, Sustainability, and Results renowned social changemakers Jakada Imani, Monna Wong, and Bex Ahuja deliver an effective and practical how-to guide for the equitable management of nonprofit and social change organizations. In the book, you'll learn how to multiply your impact by using the authors' insightful strategies for delegation, goal setting, and team culture-building. You'll also discover how to fairly exercise power in an environment that spans racial, generational, gender, and other identity divides.\n\nManagement In a Changing World shows you how to:\n\nCreate work-life balance for your team members in an age when we have virtually unlimited access to our colleagues' attention and time\nSupport team members through life's challenges while still meeting the demands your social change organization faces\nBridge the gap between your intentions and your real-world impact with actionable advice, tools, and resources\n\n\n\nAn essential resource for rookie and veteran managers, executive directors, and CEOs, Management In a Changing World will also earn a place on the bookshelves of organizers managing teams of volunteers.",
    "BISAC_Categories": [
      "Nonprofit Organizations & Charities - General",
      "Leadership"
    ],
    "About_Author": "Jakada Imani is the CEO of The Management Center, a nonprofit capacity-building organization based in Washington, DC. He is a coach and trainer with more than 30 years' experience working in racial, social, and economic justice movements.\n\nMonna Wong is the Chief Content Officer at The Management Center. She is a facilitator, organizer, and writer who has led teams in Ohio, Maryland, Maine, and California to build power for LGBTQ and Asian Pacific Islander communities.\n\nBex Ahuja is the Managing Director at Rockwood Leadership Institute. Bex is a seasoned campaign strategist, organizer, trainer, and senior leader with 18 years experience working at the intersection of movement-building, leadership development, and racial and gender justice.",
    "Reviews": null
  },
  {
    "Author": "Britney Spears ",
    "Book_Name": "The Woman in Me",
    "Book_Image": "https://images-us.bookshop.org/ingram/9781668009048.jpg?height=500&v=v2-df44247d8583057aecc1c2e085d8a7a6",
    "Product_Details": [
      {
        "Availability_Status": "InStock",
        "Price": [
          {
            "Primary_Price": "$32.99 ",
            "Discounted_Price": "$30.68"
          }
        ],
        "Publisher": "Gallery Books",
        "Date_Published": "October 24, 2023",
        "Pages": "288",
        "Dimensions": "6.2 X 9.0 X 1.2 inches | 1.0 pounds",
        "Language": "English",
        "Format": "Hardcover",
        "EAN_UPC_Code": "9781668009048"
      }
    ],
    "Description": "In Britney Spears's memoir, she's stronger than ever.\" --The New York Times\n\nThe Woman in Me is a brave and astonishingly moving story about freedom, fame, motherhood, survival, faith, and hope.\n\nIn June 2021, the whole world was listening as Britney Spears spoke in open court. The impact of sharing her voice--her truth--was undeniable, and it changed the course of her life and the lives of countless others. The Woman in Me reveals for the first time her incredible journey--and the strength at the core of one of the greatest performers in pop music history.\n\nWritten with remarkable candor and humor, Spears's groundbreaking book illuminates the enduring power of music and love--and the importance of a woman telling her own story, on her own terms, at last.",
    "BISAC_Categories": [
      "Entertainment & Performing Arts",
      "Rich & Famous",
      "Personal Memoirs",
      "Music"
    ],
    "About_Author": "Multi-platinum, Grammy Award-winning pop icon Britney Spears is one of the most successful and celebrated entertainers in music history, with more than 100 million records sold worldwide. In 2021, she was named one of Time magazine's 100 Most Influential People. Spears's album Blackout was added to the Rock & Roll Hall of Fame's Library & Archives in 2012. She lives in Los Angeles, California.",
    "Reviews": [
      "\"Emerging radiant through the chaos . . . in Britney Spears's memoir, she's stronger than ever. . . . [It's] presented so cleanly and candidly that The Woman in Me seems designed to be read in one sitting. It's nearly impossible to come out of it without empathy for and real outrage on behalf of Spears, whose admitted bitterness over the dire circumstances of the last decade-plus of her life . . . is tempered by an enduring, insistent optimism.\" --The New York Times",
      "\"Moving.\" --Time",
      "\"Powerful in its vividness . . . much has been made of the 'bombshell' revelations from this memoir . . . but vastly more interesting are the quiet revelations about herself. . . . Spears has always been funny and so unequivocally herself, even when recounting her mistreatment by most of the men in her life. . . . You can sense Spears gaining her power back, inch by inch. The Woman in Me is a worthy act of self-resurrection.\" --Los Angeles Times",
      "\"Breathtaking.\" --The Independent (UK)",
      "\"A miracle.\" --The Guardian (UK)",
      "\"Poignant.\" --Vogue",
      "\"Britney Spears holds nothing back in her short, bittersweet, and extremely powerful memoir. . . . A testament to Spears's essential fortitude of spirit--something that burns off these pages.\" --The Telegraph (UK)"
    ]
  },
  {
    "Author": "Rebecca Yarros ",
    "Book_Name": "Iron Flame",
    "Book_Image": "https://images-us.bookshop.org/ingram/9781649374172.jpg?height=500&v=v2-7485d4034deced08d97c39b117fa199f",
    "Product_Details": [
      {
        "Availability_Status": "BackOrder",
        "Price": [
          {
            "Primary_Price": "$29.99 ",
            "Discounted_Price": "$27.89"
          }
        ],
        "Publisher": "Entangled: Red Tower Books",
        "Date_Published": "November 07, 2023",
        "Pages": "640",
        "Dimensions": "6.5 X 8.5 X 2.8 inches | 1.8 pounds",
        "Language": "English",
        "Format": "Hardcover",
        "EAN_UPC_Code": "9781649374172"
      }
    ],
    "Description": "PLEASE NOTE: The limited edition with stained edges is sold out, but we invite you to purchase an unstained edition--same captivating story, same heart-pounding read!\n\n\"The first year is when some of us lose our lives. The second year is when the rest of us lose our humanity.\" --Xaden Riorson\n\nEveryone expected Violet Sorrengail to die during her first year at Basgiath War College--Violet included. But Threshing was only the first impossible test meant to weed out the weak-willed, the unworthy, and the unlucky.\n\nNow the real training begins, and Violet's already wondering how she'll get through. It's not just that it's grueling and maliciously brutal, or even that it's designed to stretch the riders' capacity for pain beyond endurance. It's the new vice commandant, who's made it his personal mission to teach Violet exactly how powerless she is-unless she betrays the man she loves.\n\nAlthough Violet's body might be weaker and frailer than everyone else's, she still has her wits--and a will of iron. And leadership is forgetting the most important lesson Basgiath has taught her: Dragon riders make their own rules.\n\nBut a determination to survive won't be enough this year.\n\nBecause Violet knows the real secret hidden for centuries at Basgiath War College--and nothing, not even dragon fire, may be enough to save them in the end.\n\nThe Empyrean series is best enjoyed in order.\nReading Order:\nBook #1 Fourth Wing\nBook #2 Iron Flame",
    "BISAC_Categories": [
      "Fantasy - Epic",
      "Fantasy - Romantic"
    ],
    "About_Author": "Rebecca Yarros is the #1 New York Times, USA Today, and Wall Street Journal bestselling author of over fifteen novels including Fourth Wing and In the Likely Event, with multiple starred Publishers Weekly reviews and a Kirkus Best Book of the Year. She loves military heroes and has been blissfully married to hers for over twenty years. She's the mother of six children, and is currently surviving the teenage years with two of her four hockey-playing sons. When she's not writing, you can find her at the hockey rink or sneaking in some guitar time while guzzling coffee. She and her family live in Colorado with their stubborn English bulldogs, two feisty chinchillas, and a Maine Coon cat named Artemis, who rules them all.\n\nHaving fostered then adopted their youngest daughter, Rebecca is passionate about helping children in the foster system through her nonprofit, One October, which she co-founded with her husband in 2019. To learn more about their mission to better the lives of kids in foster care, visit www.oneoctober.org.\n\nTo catch up on Rebecca's latest releases and upcoming novels visit www.RebeccaYarros.com.",
    "Reviews": null
  },
  {
    "Author": "Mercury Stardust ",
    "Book_Name": "Safe and Sound: A Renter-Friendly Guide to Home Repair",
    "Book_Image": "https://images-us.bookshop.org/ingram/9780744079074.jpg?height=500&v=v2-da93e8f9a9a6d8a4320c20dbe3979ba9",
    "Product_Details": [
      {
        "Availability_Status": "InStock",
        "Price": [
          {
            "Primary_Price": "$24.99 ",
            "Discounted_Price": "$23.24"
          }
        ],
        "Publisher": "DK Publishing (Dorling Kindersley)",
        "Date_Published": "August 22, 2023",
        "Pages": "224",
        "Dimensions": "7.9 X 9.3 X 1.0 inches | 2.25 pounds",
        "Language": "English",
        "Format": "Hardcover",
        "EAN_UPC_Code": "9780744079074"
      }
    ],
    "Description": "1 New York Times Bestseller\n\nDon't panic--Mercury Stardust, AKA The Trans Handy Ma'am is here to help!\n\nFor too many people, the simple act of contacting a plumber or repair person can feel like a game of chance. As a transwoman and a professional maintenance technician, Mercury Stardust has discovered (the hard way) that we live in a world with much to fear. If you've ever felt panicked about opening your home to strangers in order to fix a maintenance issue, this book is for you.\n\nRenting a home can be a complex process--from finding a safe and affordable space, to hiring help for moving in and out, and of course, managing any repairs that come up during your stay.\n\nYou deserve to feel empowered to take matters into your own hands--and it's not as hard as you might think. In this book, Mercury will show you how to tackle the projects that need improvement in your home--from how to properly fix a clog in your bathroom sink and safely hang things on your walls to patching small and medium drywall holes.\n\nSafe and Sound includes:\n\nGuidance for over 50 simple home maintenance projects, such as replacing your showerhead and troubleshooting a faulty garbage disposal.\nChapters covering basic and handy repairs for your plumbing, electrical, carpentry, and safety needs.\nAdvice tailored to renters to minimize permanent changes.\nHelpful illustrations and QR code links to videos to help you on your journey.\n\nRemember--a little bit of knowledge can go a long way toward making you feel more safe and in control of your own life.",
    "BISAC_Categories": [
      "LGBT",
      "Maintenance & Repair",
      "Reference",
      "Remodeling & Renovation - General"
    ],
    "About_Author": "Mercury Stardust (@mercurystardust), the Trans Handy Ma'am, is a professional home maintenance technician and award-winning activist. Mercury credits her TikTok success to her experience teaching burlesque, where she learned to communicate and create a safe space for students who had frequently experienced trauma. She's been featured in stories by NBC, NPR, Buzzfeed, Newsweek, Washington Post, and Pink News. Her leadership within the trans community has led to collaborations with such brands as Dolby, Lowe's, and Point of Pride.",
    "Reviews": null
  },
  {
    "Author": "Sohla El-Waylly ",
    "Book_Name": "Start Here: Instructions for Becoming a Better Cook: A Cookbook",
    "Book_Image": "https://images-us.bookshop.org/ingram/9780593320464.jpg?height=500&v=v2-7e7e022a86aed138106a18dacc0f1f8d",
    "Product_Details": [
      {
        "Availability_Status": "InStock",
        "Price": [
          {
            "Primary_Price": "$45.00 ",
            "Discounted_Price": "$41.85"
          }
        ],
        "Publisher": "Knopf Publishing Group",
        "Date_Published": "October 31, 2023",
        "Pages": "656",
        "Dimensions": "8.74 X 11.02 X 1.5 inches | 5.35 pounds",
        "Language": "English",
        "Format": "Hardcover",
        "EAN_UPC_Code": "9780593320464"
      }
    ],
    "Description": "hange the way you think about cooking! In this epic guide to better eating, the chef, recipe developer, and video producer Sohla El-Waylly reimagines what a cookbook can be, teaching home cooks of all skill levels how cooking really works.\n\n\"The book I wish someone had handed me when I began my own journey as a cook.\"--from the Foreword by Samin Nosrat, New York Times bestselling author of Salt, Fat, Acid, Heat\n\n\"A book to return to again and again and again.\" --Yotam Ottolenghi, New York Times bestselling author of Plenty and Ottolenghi Simple\n\nA practical, information-packed, and transformative guide to becoming a better cook and conquering the kitchen, Start Here is a must-have master class in leveling up your cooking.\n\nAcross a dozen technique-themed chapters--from \"Temperature Management 101\" and \"Break it Down & Get Saucy\" to \"Go to Brown Town,\" \"All About Butter,\" and \"Getting to Know Dough\"--Sohla El-Waylly explains the hows and whys of cooking, introducing the fundamental skills that you need to become a more intuitive, inventive cook.\n\nA one-stop resource, regardless of what you're hungry for, Start Here gives equal weight to savory and sweet dishes, with more than two hundred mouthwatering recipes, including:\n\nCrispy-Skinned Salmon with Radishes & Nuoc Cham\nCharred Lemon Risotto\nChilled Green Tahini Soba\nLemon, Pecorino & Potato Pizza\nFruity-Doodle Cookies\nMasa & Buttermilk Tres Leches\n\nPacked with practical advice and scientific background, and an almost endless assortment of recipe variations, along with tips, guidance, and how-tos, Start Here is culinary school--without the student loans.",
    "BISAC_Categories": [
      "Courses & Dishes - Desserts",
      "Individual Chefs & Restaurants",
      "Methods - Baking",
      "Reference"
    ],
    "About_Author": "SOHLA EL-WAYLLY is a culinary creator, writer, video producer, and community advocate who has been featured in The New York Times and Bon Appétit and on Food52 and Serious Eats. Her on-camera credits include starring in HBO Max's The Big Brunch and The History Channel's Ancient Recipes with Sohla. She studied at the Culinary Institute of America in Hyde Park before training at various New York City restaurants such as Del Posto, Atera, and Battersby. A TIME100 Next honoree, she lives in the East Village with her husband, two dogs, and cat.",
    "Reviews": [
      "\"The perfect companion to anyone starting out in the kitchen. In sharing so much experience and knowledge--not to mention so many recipes that I want to eat--Sohla has crafted a book to return to again and again and again.\" --Yotam Ottolenghi, New York Times bestselling author of Plenty and Ottolenghi Simple",
      "",
      "\"The book I wish someone had handed me when I began my own journey as a cook . . . Sohla has improved my cooking, and I guarantee she will improve yours, too.\" --Samin Nosrat, New York Times bestselling author of Salt, Fat, Acid, Heat (from the Foreword)",
      "",
      "\"Sohla breaks down cooking in a way that's elemental yet approachable. She is the patient friend, the seasoned guide, the doting mentor you want in the kitchen. This book will not only teach you the principles of good cooking, but also boost your confidence, allowing you to freestyle it in the kitchen like a master. There's something for everyone in this future classic. Buy this book now!\" --Padma Lakshmi",
      "",
      "\"A foundational behemoth of a book (656 pages!) in the school of J. Kenji López-Alt's The Food Lab and Samin Nosrat's Salt, Fat, Acid, Heat . . . Every home cook will find something to learn in Start Here.\" --Eater",
      "",
      "\"We typically use the word 'cookbook' to describe a series of tasty recipes we re-create in our home kitchens that make us feel awesome. Only we're never really taught how to cook. Enter: the incredible Sohla El-Waylly, our officially unofficial guide to kitchen bootcamp, equipping us with the skills we need to feel confident in the kitchen--not capable, not able, confident . . . Start Here is nothing short of a game changer.\" --Christina Tosi, chef & founder, Milk Bar",
      "",
      "\"This book has done the impossible: It's inspired me to cook. Start Here is an instant classic destined to be a kitchen staple. Sohla has revolutionized what a cookbook can be in a way that speaks so uniquely to her razor-sharp wit, generosity of spirit, and undeniable skill.\" --Dan Levy, Emmy Award-winning writer, actor, director, and producer of Schitt's Creek",
      "",
      "\"El-Waylly distills takeaways from her time in cooking school, years-long tenure at restaurants, and her experience as a Bon Appétit staffer to bring home cooks the foundations they need to be more confident in the kitchen . . . This cookbook is the mirror I wish I had as a student in culinary school . . . With each recipe, technique overview, and the stories within, El-Waylly makes the unattainable achievable in more ways than one.\" --Anikah Shaokat, Epicurious",
      "",
      "\"A one-stop grand diplôme in the culinary arts taught by one of the most talented and knowledgable chefs, Sohla El-Waylly . . . Start Here is an instant, must-have classic.\" --Rick Andrew Martínez, best-selling author and video host",
      "",
      "\"Where was this book when I first started cooking? . . . Jam-packed with science-backed tips and techniques to help folks develop their cooking intuition, and I have no doubt a copy of the book would have saved me from many sad, under-seasoned meals . . . You'll leave feeling more comfortable in the kitchen.\" --Genevieve Yam, Bon Appétit",
      "",
      "\"I am an instant fan of any book that crams in this much knowledge and science right alongside things like Lisa Frank Cookies and not one but FOUR kinds of homemade fun dip! . . . I don't know who's more excited, my brain or my belly!\" --Molly Yeh, New York Times best-selling author and Food Network host",
      "",
      "\"Cooking through Start Here has brought more joy to my kitchen than any cookbook in memory. Spoiler alert for my friends: This is what you're getting for Christmas.\" --Stella Parks, James Beard Award-winning author of BraveTart",
      "",
      "\"Clear, funny, smart, and necessary.\" --Vogue",
      "",
      "\"Sohla's book is brilliantly organized and superbly written, with photographs that teach as well as inspire. Reading Start Here is like getting a fully accredited culinary degree from a professional who sees food and cooking through a grounded but completely modern perspective. Every recipe delivers. Add to cart! You need this book.\" --Carla Lalli Music, author of That Sounds So Good and Where Cooking Begins",
      "",
      "\"A cookbook you read and then keep on hand, referencing whenever you have a question, want to master a basic, or take a particular skill to the next level . . . Straightforward, approachable, and generous.\" --The Strategist"
    ]
  },
  {
    "Author": "Jon Favreau ",
    "Book_Name": "Democracy or Else: How to Save America in 10 Easy Steps",
    "Book_Image": "https://images-us.bookshop.org/ingram/9781638931430.jpg?height=500&v=v2-96069b7832bf12644c914fe75cbcaa68",
    "Product_Details": [
      {
        "Availability_Status": "PreOrder",
        "Price": [
          {
            "Primary_Price": "$28.00 ",
            "Discounted_Price": "$26.04"
          }
        ],
        "Publisher": "Crooked Media Reads",
        "Date_Published": "June 25, 2024",
        "Pages": "288",
        "Dimensions": "0.0 X 0.0 X 0.0 inches | 0.0 pounds",
        "Language": "English",
        "Format": "Hardcover",
        "EAN_UPC_Code": "9781638931430"
      }
    ],
    "Description": "rom your friends at Pod Save America and Crooked Media comes a useful and illustrated guide to saving American democracy just in time for the 2024 election and 2025 insurrectionIf you're looking to navigate the chaotic, dunce-infested waters of American politics, Democracy or Else is here to help you tackle what might be the greatest question of our time: How do you get involved in the political process and make a real difference without giving in to the sense of impending dread that hangs over our society like a nameless stench? Each chapter will take readers step-by-step through the perilous journey of\n\nGetting informed when you don't know which influencer to trust (all of them!)\nDonating and volunteering where you can have the biggest impact\nOrganizing, protesting, and even running for office yourself\nStaying engaged in politics without losing hope or your mind or all of your friends\n\nDemocracy or Else is a resource for everyone--from political junkies following every turn of the news cycle to young people getting ready to vote for the first time. And it's filled with practical advice from some of the smartest experts and least annoying politicians around. The stakes and average global temperatures have never been higher--but there have also never been so many opportunities to join the fight. It's an age of contradictions!",
    "BISAC_Categories": [
      "Topic - Politics",
      "Civics & Citizenship",
      "Political Process - Campaigns & Elections",
      "Political Process - Political Advocacy",
      "Activism & Social Justice"
    ],
    "About_Author": "Former White House aides during the Obama administration, Jon Favreau, Jon Lovett, and Tommy Vietor are the hosts of the widely popular podcast Pod Save America. A no-bullshit conversation about politics, Pod Save America cuts through the noise to break down the week's news and helps listeners figure out what actually matters and how they can help. The hosts are regularly joined by journalists, activists, politicians, entertainers, and world leaders.\n\n--\n\n \n\n--",
    "Reviews": null
  },
  {
    "Author": "Angela Y Davis ",
    "Book_Name": "Freedom Is a Constant Struggle: Ferguson, Palestine, and the Foundations of a Movement",
    "Book_Image": "https://images-us.bookshop.org/ingram/9781608465644.jpg?height=500&v=v2-f0ea8d23c81912d535e46b1ee9da3eee",
    "Product_Details": [
      {
        "Availability_Status": "InStock",
        "Price": [
          {
            "Primary_Price": "$15.95 ",
            "Discounted_Price": "$14.83"
          }
        ],
        "Publisher": "Haymarket Books",
        "Date_Published": "February 09, 2016",
        "Pages": "176",
        "Dimensions": "5.3 X 7.4 X 0.5 inches | 0.45 pounds",
        "Language": "English",
        "Format": "Paperback",
        "EAN_UPC_Code": "9781608465644"
      },
      {
        "Availability_Status": "InStock",
        "Price": [
          {
            "Primary_Price": "$45.00 ",
            "Discounted_Price": "$41.85"
          }
        ],
        "Publisher": "Haymarket Books",
        "Date_Published": "February 06, 2016",
        "Pages": "176",
        "Dimensions": "5.83 X 8.27 X 0.56 inches | 0.85 pounds",
        "Language": "English",
        "Format": "Hardcover",
        "EAN_UPC_Code": "9781642591682"
      },
      {
        "Availability_Status": "BackOrder",
        "Price": [
          {
            "Primary_Price": "$34.99 ",
            "Discounted_Price": "$32.54"
          }
        ],
        "Publisher": "Tantor Audio",
        "Date_Published": "September 13, 2016",
        "Pages": null,
        "Dimensions": "5.8 X 5.7 X 0.6 inches | 0.4 pounds",
        "Language": "English",
        "Format": "Compact Disc",
        "EAN_UPC_Code": "9781799976493"
      }
    ],
    "Description": "n these newly collected essays, interviews, and speeches, world-renowned activist and scholar Angela Y. Davis illuminates the connections between struggles against state violence and oppression throughout history and around the world.\n\nReflecting on the importance of black feminism, intersectionality, and prison abolitionism for today's struggles, Davis discusses the legacies of previous liberation struggles, from the Black Freedom Movement to the South African anti-Apartheid movement. She highlights connections and analyzes today's struggles against state terror, from Ferguson to Palestine.\n\nFacing a world of outrageous injustice, Davis challenges us to imagine and build the movement for human liberation. And in doing so, she reminds us that Freedom is a constant struggle.\n\nAngela Y. Davis is a political activist, scholar, author, and speaker. She is an outspoken advocate for the oppressed and exploited, writing on Black liberation, prison abolition, the intersections of race, gender, and class, and international solidarity with Palestine. She is the author of several books, including Women, Race, and Class and Are Prisons Obsolete? She is the subject of the acclaimed documentary Free Angela and All Political Prisoners and is Distinguished Professor Emerita at the University of California, Santa Cruz.\n\nOne of America's most provocative public intellectuals, Dr. Cornel West has been a champion for racial justice since childhood. His writing, speaking, and teaching weave together the traditions of the black Baptist Church, progressive politics, and jazz. The New York Times has praised his ferocious moral vision. His many books include Race Matters, Democracy Matters, and his autobiography, Brother West: Living and Loving Out Loud.\n\nFrank Barat is a human rights activist and author. He was the coordinator of the Russell Tribunal on Palestine and is now the president of the Palestine Legal Action Network. His books include Gaza in Crisis and Corporate Complicity in Israel's Occupation.\n",
    "BISAC_Categories": [
      "Civil Rights",
      "Essays",
      "Black Studies (Global)",
      "Ethnic Studies - African American Studies",
      "Globalization",
      "World - Middle Eastern",
      "Essays"
    ],
    "About_Author": "Angela Y. Davis is a political activist, scholar, author, and speaker. She is an outspoken advocate for the oppressed and exploited, writing on Black liberation, prison abolition, the intersections of race, gender, and class, and international solidarity with Palestine. She is the author of several books, including Women, Race, and Class and Are Prisons Obsolete? She is the subject of the acclaimed documentary Free Angela and All Political Prisoners and is Distinguished Professor Emerita at the University of California, Santa Cruz.\n\nOne of America's most provocative public intellectuals, Dr. Cornel West has been a champion for racial justice since childhood. His writing, speaking, and teaching weave together the traditions of the black Baptist Church, progressive politics, and jazz. The New York Times has praised his ferocious moral vision. His many books include Race Matters, Democracy Matters, and his new autobiography, Brother West: Living and Loving Out Loud.\n\nFrank Barat is a human rights activist and author. He was the coordinator of the Russell Tribunal on Palestine and is now the president of the Palestine Legal Action Network. His books include Gaza in Crisis and Corporate Complicity in Israel's Occupation.\n",
    "Reviews": [
      "Angela Davis new book made me think of what Dear Nelson Mandela kept reminding us, that we must be willing to embrace that long walk to freedom. Understanding what it takes to really be free, to have no fear, is the first and most important step one has to make before undertaking this journey. Angela is the living proof that this arduous challenge can also be an exhilarating and beautiful one.--Archbishop Desmond Tutu",
      "",
      "Whether you've grown up with the courage and conscience of Angela Davis, or are discovering her for the first time, Freedom Is a Constant Struggle is a small book that will be a huge help in daily life and action, from exposing the prison industrial complex that she named long ago to understanding that leaders are only leaders if they empower others. She herself exposes facts and makes connections, but also leads in the most important way-by example.--Gloria Steinem",
      "",
      "This is vintage Angela: insightful, curious, observant, and brilliant, asking and answering questions about events in this new century that look surprisingly similar to the last century.--Mumia Abu-Jamal",
      "",
      "Here is someone worthy of the Ancestors who delivered her. Angela Davis has stood her ground on every issue important to the health of our people and the planet. It is impossible to read her words or hear her voice and not be moved to comprehension and gratitude for our incredible luck in having her with us.--Alice Walker",
      "",
      "Angela Davis once again offers us an incisive, urgent, and comprehensive understanding of systematic racism, the grounds for intersectional analysis and solidarity, and the importance of working together as equals to unmask and depose systems of injustice. This wide-ranging and brilliant set of essays includes a trenchant analysis of police violence against people of color, of the systematic incarceration of black people in America, the grounds of Palestinian solidarity for the Left, the affirmation of transgender inclusion, and the necessity of opposing the G4S corporation and its high-profit empire dedicated to the institutionalization of racism in the name of security. These essays take us back in history to the founders of revolutionary and anti-racist struggle, but they also take us toward the possibility of ongoing intersectional solidarity and struggle. Angela Davis gathers in her lucid words our luminous history and the most promising future of freedom.--Judith Butler",
      "",
      "She has eyes in the back of our head. With her we can survive and resist.--John Berger",
      "",
      "In this latest text of her magisterial corpus, Angela Davis puts forward her brilliant analyses and resilient witness here and abroad. In a clear and concise manner, she embodies and enacts \"intersectionality\" - a structural intellectual and political response to the dynamics of violence, White Supremacy, patriarchy, state power, capitalist markets, and imperial policies.--Dr. Cornel West, from the Foreword"
    ]
  },
  {
    "Author": "David Grann ",
    "Book_Name": "Killers of the Flower Moon: The Osage Murders and the Birth of the FBI",
    "Book_Image": "https://images-us.bookshop.org/ingram/9780307742483.jpg?height=500&v=v2-b1370c3b348cf5a22d5460bb2f4efb68",
    "Product_Details": [
      {
        "Availability_Status": "InStock",
        "Price": [
          {
            "Primary_Price": "$17.00 ",
            "Discounted_Price": "$15.81"
          }
        ],
        "Publisher": "Vintage",
        "Date_Published": "April 03, 2018",
        "Pages": "416",
        "Dimensions": "5.1 X 7.9 X 0.9 inches | 0.86 pounds",
        "Language": "English",
        "Format": "Paperback",
        "EAN_UPC_Code": "9780307742483"
      },
      {
        "Availability_Status": "InStock",
        "Price": [
          {
            "Primary_Price": "$35.00 ",
            "Discounted_Price": "$32.55"
          }
        ],
        "Publisher": "Doubleday Books",
        "Date_Published": "April 18, 2017",
        "Pages": "352",
        "Dimensions": "6.3 X 9.3 X 1.3 inches | 1.4 pounds",
        "Language": "English",
        "Format": "Hardcover",
        "EAN_UPC_Code": "9780385534246"
      },
      {
        "Availability_Status": "BackOrder",
        "Price": [
          {
            "Primary_Price": "$31.00 ",
            "Discounted_Price": "$28.83"
          }
        ],
        "Publisher": "Random House Large Print Publishing",
        "Date_Published": "April 18, 2017",
        "Pages": "512",
        "Dimensions": "6.1 X 9.0 X 1.2 inches | 1.3 pounds",
        "Language": "English",
        "Format": "Paperback",
        "EAN_UPC_Code": "9781524755935"
      }
    ],
    "Description": "1 NEW YORK TIMES BESTSELLER - A twisting, haunting true-life murder mystery about one of the most monstrous crimes in American history, from the author of The Wager and The Lost City of Z, \"one of the preeminent adventure and true-crime writers working today.\"--New York Magazine - NATIONAL BOOK AWARD FINALIST - NOW A MARTIN SCORSESE PICTURE\n\n\"A shocking whodunit...What more could fans of true-crime thrillers ask?\"--USA Today\n\n\"A masterful work of literary journalism crafted with the urgency of a mystery.\" --The Boston Globe\n\nIn the 1920s, the richest people per capita in the world were members of the Osage Nation in Oklahoma. After oil was discovered beneath their land, the Osage rode in chauffeured automobiles, built mansions, and sent their children to study in Europe.\n\nThen, one by one, the Osage began to be killed off. The family of an Osage woman, Mollie Burkhart, became a prime target. One of her relatives was shot. Another was poisoned. And it was just the beginning, as more and more Osage were dying under mysterious circumstances, and many of those who dared to investigate the killings were themselves murdered.\n\nAs the death toll rose, the newly created FBI took up the case, and the young director, J. Edgar Hoover, turned to a former Texas Ranger named Tom White to try to unravel the mystery. White put together an undercover team, including a Native American agent who infiltrated the region, and together with the Osage began to expose one of the most chilling conspiracies in American history.\n\nLook for David Grann's latest bestselling book, The Wager!",
    "BISAC_Categories": [
      "United States - 20th Century",
      "Murder - General",
      "Native American",
      "Subjects & Themes - General",
      "Americas (North Central South West Indies)"
    ],
    "About_Author": "DAVID GRANN is the author of the #1 New York Times bestsellers KILLERS OF THE FLOWER MOON and THE LOST CITY OF Z. KILLERS OF THE FLOWER MOON was a finalist for The National Book Award and won an Edgar Allan Poe Award. He is also the author of THE WHITE DARKNESS and the collection THE DEVIL AND SHERLOCK HOLMES. Grann's storytelling has garnered several honors, including a George Polk Award. He lives with his wife and children in New York.",
    "Reviews": [
      "NEW YORK TIMES BEST SELLER - A NEW YORK TIMES NOTABLE BOOK",
      "",
      "A BEST BOOK OF THE YEAR: Wall Street Journal, The Boston Globe, San Francisco Chronicle, GQ, Time, Newsday, Entertainment Weekly, Time Magazine, NPR, Vogue, Smithsonian, Cosmopolitan, Seattle Times, Bloomberg, Lit Hub, and Slate",
      "",
      "\"Disturbing and riveting. . . . Grann has proved himself a master of spinning delicious, many-layered mysteries that also happen to be true. . . . It will sear your soul.\"",
      "--Dave Eggers, New York Times Book Review",
      "",
      "\"A marvel of detective-like research and narrative verve.\"",
      "--Financial Times",
      "",
      "\"A shocking whodunit. . . . What more could fans of true-crime thrillers ask?\"",
      "--USA Today",
      "",
      "\"A master of the detective form. . . . Killers is something rather deep and not easily forgotten.\"",
      "--Wall St. Journal",
      "",
      "\"The best book of the year so far.\"",
      "--Entertainment Weekly",
      "",
      "\"David Grann's Killers of the Flower Moon is unsurprisingly extraordinary.\"",
      "--Time",
      "",
      "\"A masterful work of literary journalism crafted with the urgency of a mystery. . . . Contained within Grann's mesmerizing storytelling lies something more than a brisk, satisfying read. Killers of the Flower Moon offers up the Osage killings as emblematic of America's relationship with its indigenous peoples and the 'culture of killing' that has forever marred that tie.\"",
      "--The Boston Globe",
      "",
      "\"[C]lose to impeccable. It's confident, fluid in its dynamics, light on its feet. . . . The crime story it tells is appalling, and stocked with authentic heroes and villains. It will make you cringe at man's inhumanity to man.\"",
      "--The New York Times"
    ]
  },
  {
    "Author": "Marc Lamont Hill ",
    "Book_Name": "Except for Palestine: The Limits of Progressive Politics",
    "Book_Image": "https://images-us.bookshop.org/ingram/9781620975923.jpg?height=500&v=v2",
    "Product_Details": [
      {
        "Availability_Status": "InStock",
        "Price": [
          {
            "Primary_Price": "$25.99 ",
            "Discounted_Price": "$24.17"
          }
        ],
        "Publisher": "New Press",
        "Date_Published": "February 16, 2021",
        "Pages": "240",
        "Dimensions": "5.4 X 8.6 X 1.0 inches | 0.85 pounds",
        "Language": "English",
        "Format": "Hardcover",
        "EAN_UPC_Code": "9781620975923"
      },
      {
        "Availability_Status": "InStock",
        "Price": [
          {
            "Primary_Price": "$17.99 ",
            "Discounted_Price": "$16.73"
          }
        ],
        "Publisher": "New Press",
        "Date_Published": "May 31, 2022",
        "Pages": "240",
        "Dimensions": "5.43 X 8.35 X 0.79 inches | 0.6 pounds",
        "Language": "English",
        "Format": "Paperback",
        "EAN_UPC_Code": "9781620977255"
      }
    ],
    "Description": "A bold call for the American Left to extend their politics to the issues of Israel-Palestine, from a New York Times bestselling author and an expert on U.S. policy in the region\n\nIn this major work of daring criticism and analysis, scholar and political commentator Marc Lamont Hill and Israel-Palestine expert Mitchell Plitnick spotlight how holding fast to one-sided and unwaveringly pro-Israel policies reflects the truth-bending grip of authoritarianism on both Israel and the United States. Except for Palestine deftly argues that progressives and liberals who oppose regressive policies on immigration, racial justice, gender equality, LGBTQ rights, and other issues must extend these core principles to the oppression of Palestinians. In doing so, the authors take seriously the political concerns and well-being of both Israelis and Palestinians, demonstrating the extent to which U.S. policy has made peace harder to attain. They also unravel the conflation of advocacy for Palestinian rights with anti-Semitism and hatred of Israel.\n\nHill and Plitnick provide a timely and essential intervention by examining multiple dimensions of the Israeli-Palestinian conversation, including Israel's growing disdain for democracy, the effects of occupation on Palestine, the siege of Gaza, diminishing American funding for Palestinian relief, and the campaign to stigmatize any critique of Israeli occupation. Except for Palestine is a searing polemic and a cri de coeur for elected officials, activists, and everyday citizens alike to align their beliefs and politics with their values.",
    "BISAC_Categories": [
      "Middle East - Israel & Palestine",
      "Geopolitics",
      "Regional Studies"
    ],
    "About_Author": "Marc Lamont Hill is an award-winning journalist and the Steve Charles Professor of Media, Cities, and Solutions at Temple University. He is the author of multiple books, including the New York Times bestselling Nobody. He lives in Philadelphia.\nMitchell Plitnick is the president of ReThinking Foreign Policy and a frequent writer on the Middle East and U.S. foreign policy. He is the former vice president at the Foundation for Middle East Peace, director of the U.S. Office of B'Tselem, and co-director of Jewish Voice for Peace. He lives in Maryland.\n\n",
    "Reviews": [
      "Praise for Except for Palestine:",
      "\"[A] principled cri de coeur to progressives everywhere. . . . Except for Palestine is a crucial and ultimately hopeful tool that better equips progressives to combat injustices within their own political circles.\"",
      "--Mondoweiss",
      "",
      "\"For too long, many have championed the rights and liberties of oppressed peoples here and abroad, but remained silent on Palestinian freedom, or even worse, supported U.S. policies that render Palestinian humanity and suffering invisible. This clear and courageous book is a clarion call for moral integrity and political consistency.\"",
      "--Cornel West, Harvard University",
      "",
      "\"Hill and Plitnick deliver a thoughtful and incisive analysis of how progressive commitments to racial and social justice are undermined by the 'Palestinian exception.' Building the civil rights movement for the twenty-first century in America requires an international intersectionality that necessarily includes advocating for the rights and dignity of Palestinians and Israelis alike. Except for Palestine is timely and vital.\"",
      "--Congresswoman Rashida Tlaib, Michigan's 13th Congressional District",
      "",
      "\"Except for Palestine calls on progressives to apply the same principles to Israel-Palestine that they apply to the U.S. It's a simple, radical, and deeply important argument, which anyone who cherishes justice should not ignore.\"",
      "--Peter Beinart, author of The Crisis of Zionism",
      "",
      "\"Hill and Plitnick have produced a timely and powerful indictment of decades of U.S. policy exceptionalizing Israel at the expense of progressive values. Their thorough examination of American progressives' intellectual and moral hypocrisy when it comes to defending Palestinians' human rights, civil rights, and right to challenge Israeli occupation is a valuable resource.\"",
      "--Lara Friedman, president of the Foundation for Middle East Peace",
      "",
      "\"This book explores some of the most fundamental contradictions confronting liberal spaces in the U.S. and makes a powerful case for the progressive core values of humanity, justice, and dignity to finally include the Palestinian people.\"",
      "--Ahmad Abuznaid, executive director of the U.S. Campaign for Palestinian Rights",
      "",
      "\"Except for Palestine cogently explores the reasons for the silence of so many progressives and liberals when it comes to the unceasing violations of the rights of the Palestinian people. Hill and Plitnick dismantle one by one the arguments used to justify this shameful silence, and in doing so provide an eloquent, balanced, and hard-hitting analysis of why ending an egregious exception to accepted norms of justice and equality is so imperative.\"",
      "--Rashid Khalidi, author of Brokers of Deceit: How the U.S. Has Undermined Peace in the Middle East",
      "",
      "\"A timely and compelling treatise on the moral failings of U.S. policy and American politics in relation to Israel/Palestine.\"",
      "--Khaled Elgindy, Responsible Statecraft",
      ""
    ]
  },
  {
    "Author": "Heather Cox Richardson ",
    "Book_Name": "Democracy Awakening: Notes on the State of America",
    "Book_Image": "https://images-us.bookshop.org/ingram/9780593652961.jpg?height=500&v=v2-32e9c3c2b1f59fa80e0f08095aa6b8aa",
    "Product_Details": [
      {
        "Availability_Status": "InStock",
        "Price": [
          {
            "Primary_Price": "$30.00 ",
            "Discounted_Price": "$27.90"
          }
        ],
        "Publisher": "Viking",
        "Date_Published": "September 26, 2023",
        "Pages": "304",
        "Dimensions": "6.2 X 8.9 X 1.0 inches | 0.95 pounds",
        "Language": "English",
        "Format": "Hardcover",
        "EAN_UPC_Code": "9780593652961"
      },
      {
        "Availability_Status": "InStock",
        "Price": [
          {
            "Primary_Price": "$32.00 ",
            "Discounted_Price": "$29.76"
          }
        ],
        "Publisher": "Random House Large Print Publishing",
        "Date_Published": "October 24, 2023",
        "Pages": "432",
        "Dimensions": "5.9 X 9.1 X 1.0 inches | 0.9 pounds",
        "Language": "English",
        "Format": "Paperback",
        "EAN_UPC_Code": "9780593792612"
      }
    ],
    "Description": "ew York Times Bestseller\n\n\"Engaging and highly accessible.\"--Boston Globe\n\n\"A vibrant, and essential history of America's unending, enraging and utterly compelling struggle since its founding to live up to its own best ideals... It's both a cause for hope, and a call to arms.\"--Jane Mayer, author Dark Money\n\nFrom historian and author of the popular daily newsletter LETTERS FROM AN AMERICAN, a vital narrative that explains how America, once a beacon of democracy, now teeters on the brink of autocracy -- and how we can turn back.\n\nIn the midst of the impeachment crisis of 2019, Heather Cox Richardson launched a daily Facebook essay providing the historical background of the daily torrent of news. It soon turned into a newsletter and its readership ballooned to more than 2 million dedicated readers who rely on her plainspoken and informed take on the present and past in America.\n\nIn Democracy Awakening, Richardson crafts a compelling and original narrative, explaining how, over the decades, a small group of wealthy people have made war on American ideals. By weaponizing language and promoting false history they have led us into authoritarianism -- creating a disaffected population and then promising to recreate an imagined past where those people could feel important again. She argues that taking our country back starts by remembering the elements of the nation's true history that marginalized Americans have always upheld. Their dedication to the principles on which this nation was founded has enabled us to renew and expand our commitment to democracy in the past. Richardson sees this history as a roadmap for the nation's future.\n\nRichardson's talent is to wrangle our giant, meandering, and confusing news feed into a coherent story that singles out what we should pay attention to, what the precedents are, and what possible paths lie ahead. In her trademark calm prose, she is realistic and optimistic about the future of democracy. Her command of history allows her to pivot effortlessly from the Founders to the abolitionists to Reconstruction to Goldwater to Mitch McConnell, highlighting the political legacies of the New Deal, the lingering fears of socialism, the death of the liberal consensus and birth of \"movement conservatism.\"\n\nMany books tell us what has happened over the last five years. Democracy Awakening explains how we got to this perilous point, what our history really tells us about ourselves, and what the future of democracy can be.",
    "BISAC_Categories": [
      "United States - General",
      "Civics & Citizenship",
      "Political Ideologies - Democracy"
    ],
    "About_Author": "Heather Cox Richardson is a professor of history at Boston College and an expert on American political and economic history. She is the author of seven books, including the award-winning How the South Won the Civil War. Her work has appeared in The Washington Post, The New York Times, and The Guardian, among other outlets. Her widely read newsletter, Letters from an American, synthesizes history and modern political issues.",
    "Reviews": [
      "\"[Democracy Awakening] is the most lucid just-so story for Trump's rise I've ever heard. It's magisterial.\" -Virginia Heffernan, Washington Post",
      "",
      "\"Heather Cox Richardson's Democracy Awakening is an important addition to the burgeoning literature and scholarship on what I have characterized as America's Third Reconstruction...she is at her best simply telling us the story of how we came to be living on the brink of ending our nearly 250-year democratic experiment.\"",
      "-Peniel Joseph, Democracy",
      "",
      "\"A fresh historical interpretation of American democracy and its many challenges...It's an unusual but effective structure, allowing Richardson to do what she does best: show her readers how history and the present are in constant conversation. Reminding us that 'how it comes out rests...in our own hands, ' Richardson empowers us for the chapters yet to come.\"",
      "--Kirkus *Starred Review*",
      "",
      "\"Engaging and highly accessible.\"--Boston Globe",
      "",
      "\"This is a vibrant, and essential history of America's unending, enraging and utterly compelling struggle since its founding to live up to its own best ideals. From yesterday's enslavers to today's authoritarians, it shows how bad actors have always tried to twist history to serve their own purposes, but again and again, less powerful challengers have risen and often won. It's both a cause for hope, and a call to arms.\"",
      "--Jane Mayer, author Dark Money: The Hidden History of the Billionaires Behind the Rise of the Radical Right",
      "",
      "\"With her characteristic powerful prose, Heather Richardson explores the raging (in every sense of the word) political, cultural, and social forces that an elite minority has fostered to divide Americans, erode democracy, and rise to power. By reclaiming this history, she reminds us that democracy is a process, not an endpoint -- and that it demands our efforts now, more than ever.\"",
      "--Joanne Freeman, Professor of History at Yale University and author of Field of Blood",
      "",
      "\"No one understands the warp and woof of the complicated tapestry that is the United States, no one apprehends the undertow and disparate forces that have directed the tides of American politics, no one forges the connections between then and now better than Heather Cox Richardson does. The result is a cogent, challenging, thoughtful, riveting and beautiful narrative. Brava!\"",
      "--Ken Burns, Filmmaker",
      "",
      "\"For the last several turbulent years, millions have looked to Heather Cox Richardson's daily letters for vital historical perspective, wisdom, and moral clarity. In Democracy Awakening, Richardson goes beyond the news cycle to explain how we got here, placing our current political crisis against the age-old struggle to expand civil rights and economic opportunity. What emerges is a brilliant and honest account of our nation's past and present. If you care about American democracy--and are engaged in the fight to preserve it--this book is a must-read.\"",
      "--Preet Bharara, former U.S. Attorney for the Southern District of New York"
    ]
  },
  {
    "Author": "Sim Kern ",
    "Book_Name": "The Free People's Village",
    "Book_Image": "https://images-us.bookshop.org/ingram/9781646142668.jpg?height=500&v=v2-de66fa32e4825a6f585c3ae8c2dc4295",
    "Product_Details": [
      {
        "Availability_Status": "InStock",
        "Price": [
          {
            "Primary_Price": "$26.99 ",
            "Discounted_Price": "$25.10"
          }
        ],
        "Publisher": "Levine Querido",
        "Date_Published": "September 12, 2023",
        "Pages": "400",
        "Dimensions": "6.3 X 9.2 X 1.2 inches | 1.65 pounds",
        "Language": "English",
        "Format": "Hardcover",
        "EAN_UPC_Code": "9781646142668"
      }
    ],
    "Description": "SA TODAY BESTSELLER\nOfficial IndieNext Selection\n\n\"Incisive and insightful.\" -- Texas Monthly\n\nFrom environmental journalist and founder of the #TransRightsReadathon Sim Kern, comes the eat-the-rich climate fiction you won't want to put down:\n\nIn an alternate 2020 timeline, Al Gore won the 2000 election and declared a War on Climate Change rather than a War on Terror. For twenty years, Democrats have controlled all three branches of government, enacting carbon-cutting schemes that never made it to a vote in our world. Green infrastructure projects have transformed U.S. cities into lush paradises (for the wealthy, white neighborhoods, at least), and the Bureau of Carbon Regulation levies carbon taxes on every financial transaction.\n\nEnglish teacher by day, Maddie Ryan spends her nights and weekends as the rhythm guitarist of Bunny Bloodlust, a queer punk band living in a warehouse-turned-venue called \"The Lab\" in Houston's Eighth Ward. When Maddie learns that the Eighth Ward is to be sacrificed for a new electromagnetic hyperway out to the wealthy, white suburbs, she joins \"Save the Eighth,\" a Black-led organizing movement fighting for the neighborhood. At first, she's only focused on keeping her band together and getting closer to Red, their reckless and enigmatic lead guitarist. But working with Save the Eighth forces Maddie to reckon with the harm she has already done to the neighborhood--both as a resident of the gentrifying Lab and as a white teacher in a predominantly Black school.\n\nWhen police respond to Save the Eighth protests with violence, the Lab becomes the epicenter of \"The Free People's Village\"--an occupation that promises to be the birthplace of an anti-capitalist revolution. As the movement spreads across the U.S., Maddie dreams of a queer, liberated future with Red. But the Village is beset on all sides--by infighting, police brutality, corporate-owned media, and rising ecofascism. Maddie's found family is increasingly at risk from state violence, and she must decide if she's willing to sacrifice everything in pursuit of justice.\n\n\"Sim Kern's masterpiece burns with righteous fury. This book doesn't pull punches -- instead of hopelessness, it sliced straight through frustration, fatalism, and ennui and made me want to fight back.\"\n--Shana Hausman, All She Wrote Books\n\n\"Achingly real, bitterly funny, and deeply moving, The Free People's Village is a commentary, both compassionate and cutting, on the woke white activist's journey and, above all, a full-throated ode to resistance and the found family that fuels it.\"\n-- Megan Bell, Southern Bookseller Review\n\n\"Full of furious kindness, radical community, passionate politics, and authentic friendships, The Free People's Village is a sharply-written paean to hope, set in a vivid, brilliantly imagined future that alternately filled me with loathing and yearning. From the carefully crafted timelines to the intensely real characters, this was a story that yanked me into its world and didn't let me surface for hours. You live because you still can, and you organize because you still can, and you fight because you still can.\"\n- Premee Mohamed, Nebula Award-winning author of And What Can We Offer You Tonight\n\n\"A thought-provoking, exciting ride. The Free People's Village is a mesmerizing portrait of revolutions -- the internal ones that call us to find and fight for the best versions of ourselves; the external that consume, invigorate, and demand as they explore paths to justice. Grounded in an imaginative landscape and rounded out by an inclusive, complex cast, this novel masterfully explores identity, morality, and the choices we make as vehicles that hold radical power in the quest for liberation. More than a love letter to Houston, its bayous, and people forgotten and remembered, Sim Kern's world sings with possibility, hope, and joy that will leave you laughing--and crying -- long after the last bomb has dropped.\"\n--Ehigbor Okosun, author of Forged by Blood\n\n\"Beautiful, brilliant, and unflinching, The Free People's Village will both inspire you and devour you...in the best possible way.\"\n-- Nicky Drayden, author of Escaping Exodus and The Prey of Gods\n",
    "BISAC_Categories": [
      "Social Themes - General (see also headings under Family)",
      "Science Fiction - General",
      "LGBT - General",
      "Nature & the Environment"
    ],
    "About_Author": "Sim Kern is the USA Today bestselling author of The Free People's Village, an Indie Next pick. Their debut horror novella, Depart, Depart!, was selected for the Honor List for the 2020 Otherwise Award, and their short story collection, Real Sugar is Hard to Find, was hailed in a starred review by Publishers Weekly as, \"a searing, urgent, but still achingly tender work that will wow any reader of speculative fiction.\" As a journalist, they report on petrochemical polluters and drag space billionaires. Sim spent ten years teaching English to middle and high schoolers in Houston, Texas, before shifting to writing full-time. Find them all over the internet, but especially on tiktok at @simkern.",
    "Reviews": [
      "\"Beautiful, brilliant, and unflinching, The Free People's Village will both inspire you and devour you...in the best possible way.\" -- Nicky Drayden, author of Escaping Exodus and The Prey of Gods",
      "\"A thought-provoking, exciting ride. The Free People's Village is a mesmerizing portrait of revolutions -- the internal ones that call us to find and fight for the best versions of ourselves; the external that consume, invigorate, and demand as they explore paths to justice.",
      "",
      "",
      "",
      "",
      "Grounded in an imaginative landscape and rounded out by an inclusive, complex cast, this novel masterfully explores identity, morality, and the choices we make as vehicles that hold radical power in the quest for liberation. More than a love letter to Houston, its bayous, and people forgotten and remembered, Sim Kern's world sings with possibility, hope, and joy that will leave you laughing --and crying -- long after the last bomb has dropped.\" -- Ehigbor Okosun, author of Forged by Blood",
      "",
      "",
      "\"Full of furious kindness, radical community, passionate politics, and authentic friendships, The Free People's Village is a sharply-written paean to hope, set in a vivid, brilliantly imagined future that alternately filled me with loathing and yearning. From the carefully crafted timelines to the intensely real characters, this was a story that yanked me into its world and didn't let me surface for hours. You live because you still can, and you organize because you still can, and you fight because you still can.\" -- Premee Mohamed, Nebula Award-winning author of And What Can We Offer You Tonight",
      "",
      "",
      "\"A powerful story of justice denied and the legacy of activism as well as a personal journey of growth. For those who wish to learn bravery, solidarity, and community.\" --Booklist",
      "",
      "",
      "",
      "",
      "\"An enthralling novel that highlights social justice issues.\" - Foreword Reviews",
      "",
      "",
      "",
      "",
      "Publisher's Weekly's Top 10 for Fall '23",
      "",
      "",
      "",
      "",
      "\"Fierce, frenetic, and intensely impassioned.\" - Kirkus"
    ]
  },
  {
    "Author": "Alli Webb ",
    "Book_Name": "The Messy Truth: How I Sold My Business for Millions But Almost Lost Myself",
    "Book_Image": "https://images-us.bookshop.org/ingram/9781400333738.jpg?height=500&v=v2-115347d0e61cc61a7d48644ee372a0db",
    "Product_Details": [
      {
        "Availability_Status": "InStock",
        "Price": [
          {
            "Primary_Price": "$28.99 ",
            "Discounted_Price": "$26.96"
          }
        ],
        "Publisher": "Harper Horizon",
        "Date_Published": "November 14, 2023",
        "Pages": "224",
        "Dimensions": "6.2 X 9.1 X 0.8 inches | 0.8 pounds",
        "Language": "English",
        "Format": "Hardcover",
        "EAN_UPC_Code": "9781400333738"
      }
    ],
    "Description": "Alli Webb, co-founder of Drybar, had it all--until she didn't.\n\nWhen Drybar and its world-famous blowouts took off seemingly overnight, she found herself surrounded by celebrity clients like Zooey Deschanel, Jennifer Garner, Gwyneth Paltrow, Julia Roberts, Maria Shriver, and others. She was named to multiple prestigious lists by Fast Company, Fortune, Marie Claire, and Inc. She published a New York Times bestselling book--all before she turned forty.\n\nBut it wasn't until her marriage fell apart, her teenage son entered rehab unexpectedly, and she no longer found meaning in the wildly successful business she had built that Alli realized she was spiraling into deep depression. She'd lost sight of what made her happy in favor of an aimless push to succeed above all. Something had to give.\n\nPiece by piece, Alli began to reinvent her personal and professional life with the goal of accepting her messy truth. She learned how to embrace the honest in lieu of the perfect and realized that most of life happens somewhere in the middle, between the laughter and the tears.\n\nIn The Messy Truth, Webb invites readers into her world as an entrepreneur, a mother, and a partner, examining with startling humor and wisdom the truths and fictions we tell ourselves and others as we learn to embrace the mess of life.",
    "BISAC_Categories": [
      "Business",
      "Personal Memoirs",
      "Entrepreneurship",
      "Personal Success"
    ],
    "About_Author": "Alli Webb is a New York Times bestselling author, business advisor, and mentor and co-founder of several businesses, most notably Drybar, which grew from one simple idea to hundreds of locations and a full hair care and styling product line, which she sold in 2019. She lives in Los Angeles.",
    "Reviews": null
  },
  {
    "Author": "Barbra Streisand ",
    "Book_Name": "My Name Is Barbra",
    "Book_Image": "https://images-us.bookshop.org/ingram/9780525429524.jpg?height=500&v=v2-423326488e4a58703987f5082ccdff03",
    "Product_Details": [
      {
        "Availability_Status": "InStock",
        "Price": [
          {
            "Primary_Price": "$47.00 ",
            "Discounted_Price": "$43.71"
          }
        ],
        "Publisher": "Viking",
        "Date_Published": "November 07, 2023",
        "Pages": "992",
        "Dimensions": "6.1 X 9.3 X 2.2 inches | 3.1 pounds",
        "Language": "English",
        "Format": "Hardcover",
        "EAN_UPC_Code": "9780525429524"
      }
    ],
    "Description": "he long-awaited memoir by the superstar of stage, screen, recordings, and television\n\nBarbra Streisand is by any account a living legend, a woman who in a career spanning six decades has excelled in every area of entertainment. She is among the handful of EGOT winners (Emmy, Grammy, Oscar, and Tony) and has one of the greatest and most recognizable voices in the history of popular music. She has been nominated for a Grammy 46 times, and with Yentl she became the first woman to write, produce, direct, and star in a major motion picture. In My Name Is Barbra, she tells her own story about her life and extraordinary career, from growing up in Brooklyn to her first star-making appearances in New York nightclubs to her breakout performance in Funny Girl on stage and winning the Oscar for that performance on film. Then came a long string of successes in every medium in the years that followed. The book is, like Barbra herself, frank, funny, opinionated, and charming. She recounts her early struggles to become an actress, eventually turning to singing to earn a living; the recording of some of her acclaimed albums; the years of effort involved in making Yentl; her direction of The Prince of Tides; her friendships with figures ranging from Marlon Brando to Madeleine Albright; her political advocacy; and the fulfillment she's found in her marriage to James Brolin.\n\nNo entertainer's memoir has been more anticipated than Barbra Streisand's, and this engrossing and delightful book will be eagerly welcomed by her millions of fans.",
    "BISAC_Categories": [
      "Personal Memoirs"
    ],
    "About_Author": "Barbra Streisand is an American singer, actress, director and producer and one of the most iconic figures in music and film, the only recording artist in history to have earned #1 albums over six consecutive decades. She has received the American Film Institute's Lifetime Achievement Award, the Kennedy Center Honor, the National Medal of Arts, France's Légion d'Honneur, and America's highest civilian honor, the Presidential Medal of Freedom. She founded The Barbra Streisand Women's Heart Center at Cedars-Sinai, helping to raise awareness and push for more research into women's heart disease, the leading cause of death among women. Through the Streisand Foundation, which she established in 1986, she has supported national organizations working on preservation of the environment, voter education, the protection of civil liberties and civil rights, women's issues, and nuclear disarmament. In 2021 she launched the Barbra Streisand Institute at UCLA, a forward-thinking institution dedicated to finding solutions to the most vital social issues.",
    "Reviews": [
      "Praise for My Name Is Barbra",
      "",
      "\"A 970-page victory lap past all who ever doubted, diminished or dissed her. . . . Exuberant and glorious. . . . There are just so many scintillating Streisands to contemplate over so many years: singer, actress, director, producer, philanthropist, activist, lover, mother, wife, friend, autobiographer.\"",
      "--Alexandra Jacobs, New York Times Book Review",
      "",
      "\"The celebrity memoir I've coveted most is that of the singular Ms. Barbra Streisand. . . . We don't see a diva, we see a genius. . . . In a society that tends to value women's passivity while lauding their accomplishments in hindsight, it's a distinct pleasure to look back with My Name Is Barbra and marvel at how the real she came to be.\"",
      "--Brittany Luse, NPR",
      "",
      "\"[My Name Is Barbra is] enlightening. It's shake-your-head funny and hand-to-mouth surprising. The lady who wrote it is in touch with herself, loves being herself. . . . Streisand's boundlessness, her capaciousness -- the lack of precedent for her whole-enchilada ambitions, the daffiness, the sexiness, the talent, orchestration, passion, originality; her persistence and indefatigability; the outfits; the hair -- were a watershed.\"",
      "--Wesley Morris, The New York Times",
      "",
      "\"Everything you could want from a Barbra Streisand memoir. . . . Scintillating. . . . The memoir is as sharp, funny and refreshingly candid as Streisand herself.\"",
      "--USA Today",
      "",
      "\"A gloriously massive memoir from a sui generis star. . . . What a talent, what a career, what a life, and what a treat to relive it all with this most down-to-earth of demigods.\"",
      "--Kirkus Reviews (starred review)",
      "",
      "\"My Name Is Barbra dispels rumors and myths but doesn't hold back on scintillating tales of love affairs, on-set drama and unfiltered anecdotes about her discomfort with fame.\"",
      "--Los Angeles Times",
      "",
      "\"The question of her talent was never really in doubt. . . . In Streisand's book, though, there's more than just talent; we are shown craft, intelligence, a winning, rare curiosity.\"",
      "--Independent"
    ]
  },
  {
    "Author": "Deepak Bhargava ",
    "Book_Name": "Practical Radicals: Seven Strategies to Change the World",
    "Book_Image": "https://images-us.bookshop.org/ingram/9781620978214.jpg?height=500&v=v2-101018f27914f019dbb3550215947edb",
    "Product_Details": [
      {
        "Availability_Status": "InStock",
        "Price": [
          {
            "Primary_Price": "$30.99 ",
            "Discounted_Price": "$28.82"
          }
        ],
        "Publisher": "New Press",
        "Date_Published": "November 07, 2023",
        "Pages": "480",
        "Dimensions": "6.0 X 9.1 X 1.5 inches | 1.65 pounds",
        "Language": "English",
        "Format": "Hardcover",
        "EAN_UPC_Code": "9781620978214"
      }
    ],
    "Description": "A clear, expert, and inspiring guide to social change, based on case studies of grassroots movements that won, from two leading community and labor experts\n\n\"Our movements must seek and win governing power to achieve our visions for a more just society. This book is a vital resource for progressives who want to win.\" --Congresswoman Pramila Jayapal (D-WA), chair, Congressional Progressive Caucus\n\nHow do underdogs, facing far stronger opponents, sometimes win? In the tradition of Saul Alinsky's Rules for Radicals and Sun Tzu's The Art of War, Deepak Bhargava and Stephanie Luce's Practical Radicals offers winning strategies, history, and theory for a new generation of activists.\n\nBased on interviews with leading organizers, this groundbreaking book describes seven strategies to bring about transformative change. It incorporates stories of organizations and movements that have won, including Make the Road NY, the St. Paul Federation of Educators, the welfare rights movement, the Working Families Party, New Georgia Project, Occupy Wall Street, 350.org, the Fight for 15, and Gay Men's Health Crisis. Two overarching case studies anchor the book: the brilliant techniques used by enslaved people and their allies to end slavery, and the sinister but effective ways elites imposed our current system.\n\nPractical Radicals offers insights on strategy used by business, military, and political elites, addresses the challenges of overcoming conflict within organizations and movements, and concludes with a discussion of how our movements must adapt to meet new challenges in the twenty-first century.\n\nA book for activists, organizers, and anyone hoping to win the fight for a better society, Practical Radicals is a deeply informed resource designed to help us win on the big issues of our time.",
    "BISAC_Categories": [
      "Activism & Social Justice",
      "Political",
      "Peace"
    ],
    "About_Author": "Deepak Bhargava has been a leader in justice movements for over thirty years. He is currently a distinguished lecturer at the CUNY School of Labor and Urban Studies and senior fellow at the Roosevelt Institute. He is a co-founder of Leadership for Democracy and Social Justice and past president of Community Change. The co-editor (with Ruth Milkman and Penny Lewis) of Immigration Matters and co-author (with Stephanie Luce) of Practical Radicals (both published by The New Press), he lives in New York City.\n\nStephanie Luce is a professor of labor studies at CUNY's School of Labor and Urban Studies and professor of sociology at the CUNY Graduate Center. She is the author of numerous books, including Labor Movements: Global Perspectives, as well as the co-author (with Robert Pollin) of The Living Wage and co-author (with Deepak Bhargava) of Practical Radicals (both from The New Press). She lives in New York City.",
    "Reviews": [
      "Praise for Practical Radicals:",
      "",
      "",
      "\"Progressive activists will want to dog-ear, underline, and pore over this well-conceived handbook.\"",
      "--Kirkus Reviews",
      "",
      "\"Our movements must seek and win governing power to achieve our visions for a more just society. This book is a vital resource for progressives who want to win.\"",
      "--Congresswoman Pramila Jayapal (D-WA), chair of the Congressional Progressive Caucus",
      "",
      "\"Being right isn't enough. This crucial resource provides a map of the strategies we need to achieve our freedom dreams.\"",
      "--Cristina Jiménez, co-founder of United We Dream",
      "",
      "\"We now face an authoritarian coalition that is ruthless and strategic. Organizers must bring more rigor, depth, and a spirit of experimentation to our strategies if we are to prevail. This crucial book is for everyone who cares about the future of racial, gender, and economic justice and the future of democracy.\"",
      "--Dorian Warren, president of Community Change",
      "",
      "\"Bhargava and Luce bring us a deeply informed and comprehensive analysis of contemporary American social movements. Activists and organizers especially need to read this book, but so do the rest of us.\"",
      "--Frances Fox Piven",
      "",
      "\"People power on a massive scale is the only solution to the crises facing our planet. This important book helps us learn from the lineage of struggle we are part of and shows how we must innovate to meet today's challenges.\"",
      "--Varshini Prakash, co-founder and executive director, the Sunrise Movement",
      "",
      "\"This is the book I've been waiting for. It reminds progressives that we have a rich lineage of victories to draw on, from abolition to AIDS activism. And it shows us the multiple strategies we need to win today.\"",
      "--Felicia Wong, president, the Roosevelt Institute"
    ]
  },
  {
    "Author": "Jesmyn Ward ",
    "Book_Name": "Let Us Descend",
    "Book_Image": "https://images-us.bookshop.org/ingram/9781982104498.jpg?height=500&v=v2-86b233558327ba8febd2419ddcb6ca60",
    "Product_Details": [
      {
        "Availability_Status": "InStock",
        "Price": [
          {
            "Primary_Price": "$28.00 ",
            "Discounted_Price": "$26.04"
          }
        ],
        "Publisher": "Scribner Book Company",
        "Date_Published": "October 24, 2023",
        "Pages": "320",
        "Dimensions": "5.7 X 8.5 X 1.1 inches | 1.0 pounds",
        "Language": "English",
        "Format": "Hardcover",
        "EAN_UPC_Code": "9781982104498"
      }
    ],
    "Description": "rom Jesmyn Ward--the two-time National Book Award winner, youngest winner of the Library of Congress Prize for Fiction, and MacArthur Fellow--comes a haunting masterpiece, sure to be an instant classic, about an enslaved girl in the years before the Civil War.\n\n\"'Let us descend, ' the poet now began, 'and enter this blind world.'\" --Inferno, Dante Alighieri\n\nLet Us Descend is a reimagining of American slavery, as beautifully rendered as it is heart-wrenching. Searching, harrowing, replete with transcendent love, the novel is a journey from the rice fields of the Carolinas to the slave markets of New Orleans and into the fearsome heart of a Louisiana sugar plantation.\n\nAnnis, sold south by the white enslaver who fathered her, is the reader's guide through this hellscape. As she struggles through the miles-long march, Annis turns inward, seeking comfort from memories of her mother and stories of her African warrior grandmother. Throughout, she opens herself to a world beyond this world, one teeming with spirits: of earth and water, of myth and history; spirits who nurture and give, and those who manipulate and take. While Ward leads readers through the descent, this, her fourth novel, is ultimately a story of rebirth and reclamation.\n\nFrom one of the most singularly brilliant and beloved writers of her generation, this miracle of a novel inscribes Black American grief and joy into the very land--the rich but unforgiving forests, swamps, and rivers of the American South. Let Us Descend is Jesmyn Ward's most magnificent novel yet, a masterwork for the ages.",
    "BISAC_Categories": [
      "Historical - General",
      "Literary",
      "African American - Historical"
    ],
    "About_Author": "Jesmyn Ward received her MFA from the University of Michigan and has received the MacArthur Genius Grant, a Stegner Fellowship, a John and Renee Grisham Writers Residency, the Strauss Living Prize, and the 2022 Library of Congress Prize for American Fiction. She is the historic winner--first woman and first Black American--of two National Book Awards for Fiction for Sing, Unburied, Sing (2017) and Salvage the Bones (2011). She is also the author of the novel Where the Line Bleeds and the memoir Men We Reaped, which was a finalist for the National Book Critics Circle Award and won the Chicago Tribune Heartland Prize and the Media for a Just Society Award. She is currently a professor of creative writing at Tulane University and lives in Mississippi.",
    "Reviews": [
      "\"A devastating, deeply moving masterpiece.\"--Good Housekeeping",
      "",
      "\"[Ward's] most masterful work yet... Pitting ancestral wisdom and human connection against the arbitrary brutality of slavery, this book will have readers torn between wanting to savor the richness of every sentence and needing to know, immediately, what happens next.\"--Oprah Daily",
      "",
      "\"Annis's story, told in Ward's musical prose, is nothing short of epic, magical, and intensely moving.\"--Vogue",
      "",
      "\"Imaginative... Combining magical realism with historical fiction, two-time National Book Award winner Jesmyn Ward's fourth novel tells the story of Annis, an enslaved girl in the antebellum South... To survive, she must tap into the mystical in this heart-wrenching narrative of the American South in the age of slavery.\"--Time",
      "",
      "\"Ward's writing is breathtaking in its brutal honesty of life among slavers and is also lyrical in the moments of imaginative escape.\"--The Denver Harold",
      "",
      "\"A new novel from Jesmyn Ward is always a reason for celebration... In this magical realist masterwork, Ward writes with lyric brilliance about women's resilience in the face of heartbreaking odds.\"--Esquire",
      "",
      "\"This harrowing, haunting story about an enslaved girl in the years before the Civil War is inspired in part by Dante's Inferno and the descent into the underworld... Ward, the youngest winner of the Library of Congress Prize for Fiction, among many other distinctions, turns her brilliant gaze to the grief and joy of the Black American experience.\"--W Magazine",
      "",
      "\"An articulation of grief and sadness unlike anything I've ever read.... While Ward never flinches from the horrors of slavery or the deep scars it has left on America's political and social landscape, it's Annis's unwillingness to succumb to grief and loss that makes Let Us Descend such a powerful novel.\"--Locus Magazine",
      "",
      "\"Jesmyn Ward does not miss. The fourth novel from the two-time National Book Award winner, MacArthur 'Genius' fellow, and heir apparent to Toni Morrison is every bit as haunted, furious, and beautiful as 2017's Sing, Unburied, Sing... Let Us Descend is another triumph.\"--LitHub",
      "",
      "\"Shatteringly beautiful . . . In yet another masterwork, pain and sweetness alike haunt Annis. But she keeps walking.\"--Garden & Gun",
      "",
      "\"Two-time National Book Award-winner Jesmyn Ward (the first woman and the first Black American to achieve that feat) follows her fierce and tender novel Sing, Unburied, Sing with a historical narrative about survival, iron will and spiritual rebirth. Taking its title from Dante's Inferno, the story follows Annis through the hell of enslavement and the saving grace of ancestral memories.\"--LA Times",
      "",
      "\"Annis is strengthened by stories of her warrior ancestors as she struggles to retain her sense of self through the pain and terror of her journey.\"--St. Louis Post-Dispatch",
      "",
      "\"The power and artistry of Ward's work has been celebrated with numerous major awards, and her new novel will be a magnet for readers.\"--Booklist (starred review)",
      "",
      "\"[Ward] employs her prodigious skills to craft a deeply moving and empathic story... This testament to Ward's mastery of language should leave readers scrambling for a highlighter.\"--Library Journal (starred review)",
      "",
      "\"Readers won't be able to turn away.\"--Publishers Weekly (starred review)",
      "",
      "\"Saturated with terror and enchantment... What gives this volume its stature and heft among other recent novels are the power, precision, and visionary flow of Ward's writing.\"--Kirkus (starred review)",
      "",
      "\"Jesmyn is, quite simply, the best of us.\"--Ta-Nehisi Coates",
      "",
      "\"In Let Us Descend, Jesmyn Ward resurrects an enslaved girl out of the lost folds of the antebellum South, twists magic through every raindrop, mushroom, and stalk of sugar cane, and drops you into the middle of her harrowing, unendurable, magnificent song. This is a gripping, mythic, bone-pulverizing descent into the grim darkness of American slavery--and yet somehow this novel simultaneously leaves you in awe of the human capacity to not only endure, but to ascend back to the light. A spectacular achievement.\"--Anthony Doerr, author of Cloud Cuckoo Land and All The Light We Cannot See",
      "",
      "\"This harrowing, haunting story about an enslaved girl in the years before the Civil War is inspired in part by Dante's Inferno and the descent into the underworld... Ward, the youngest winner of the Library of Congress Prize for Fiction, among many other distinctions, turns her brilliant gaze to the grief and joy of the Black American experience.\"",
      "-- W Magazine, Most Anticipated of Fall",
      "",
      "Praise for Jesmyn Ward's Sing, Unburied, Sing",
      "",
      "\"Ghosts, literal and literary, haunt nearly every page of Sing, Unburied, Sing -- a novel whose boundaries between the living and the dead shift constantly, like smoke or sand. Set on the Gulf Coast of Mississippi, the book's Southern gothic aura recalls the dense, head-spinning prose of William Faulkner or Flannery O'Connor.\"--Entertainment Weekly",
      "",
      "\"However eternal its concerns, Sing, Unburied, Sing, Ward's new book, is perfectly poised for the moment.\"",
      "--The New York Times",
      "",
      "\"Staggering ... A furious brew with hints of Toni Morrison and Homer's \"The Odyssey.\"--Boston Globe",
      "",
      "\"Sing, Unburied, Sing, which is longlisted for a 2017 National Book Award, establishes Ward as one of the most poetic writers in the conversation about America's unfinished business in the black South.\"",
      "--The Atlantic",
      "",
      "\"Some chapters sound like fairy tales. This, and her ease with vernacular language, puts Ward in fellowship with such forebears as Zora Neale Hurston and William Faulkner.\"",
      "--The New Yorker",
      "",
      "\"[A] tour de force ... Ward is an attentive and precise writer who dazzles with natural and supernatural observations and lyrical details ... she continues telling stories we need to hear with rare clarity and power.\"",
      "--O, the Oprah Magazine",
      "",
      "\"Macabre and musical... Her lyrical language elevates desperation into poetic reverie ... a gripping and melodious indictment of modern racial injustices.\"",
      "--Atlanta Journal-Constitution",
      "",
      "\"If William Faulkner mined the South for gothic, stream-of-consciousness tragedy, and Toni Morrison conjured magical realism from the corroding power of the region's race hatred, then Ward is a worthy heir to both.\"",
      "--The Dallas Morning News"
    ]
  },
  {
    "Author": "Rachel Maddow ",
    "Book_Name": "Prequel: An American Fight Against Fascism",
    "Book_Image": "https://images-us.bookshop.org/ingram/9780593444511.jpg?height=500&v=v2-6cc017340ea09945c0077d8eea696e91",
    "Product_Details": [
      {
        "Availability_Status": "InStock",
        "Price": [
          {
            "Primary_Price": "$32.00 ",
            "Discounted_Price": "$29.76"
          }
        ],
        "Publisher": "Crown Publishing Group (NY)",
        "Date_Published": "October 17, 2023",
        "Pages": "416",
        "Dimensions": "6.47 X 9.54 X 1.1 inches | 1.63 pounds",
        "Language": "English",
        "Format": "Hardcover",
        "EAN_UPC_Code": "9780593444511"
      }
    ],
    "Description": "achel Maddow traces the fight to preserve American democracy back to World War II, when a handful of committed public servants and brave private citizens thwarted far-right plotters trying to steer our nation toward an alliance with the Nazis.\n\n\"A ripping read--well rendered, fast-paced and delivered with the same punch and assurance that she brings to a broadcast. . . . The parallels to the present day are strong, even startling.\"--The New York Times\n\nInspired by her research for the hit podcast Ultra, Rachel Maddow charts the rise of a wild American strain of authoritarianism that has been alive on the far-right edge of our politics for the better part of a century. Before and even after our troops had begun fighting abroad in World War II, a clandestine network flooded the country with disinformation aimed at sapping the strength of the U.S. war effort and persuading Americans that our natural alliance was with the Axis, not against it. It was a sophisticated and shockingly well-funded campaign to undermine democratic institutions, promote antisemitism, and destroy citizens' confidence in their elected leaders, with the ultimate goal of overthrowing the U.S. government and installing authoritarian rule.\n\nThat effort worked--tongue and groove--alongside an ultra-right paramilitary movement that stockpiled bombs and weapons and trained for mass murder and violent insurrection.\n\nAt the same time, a handful of extraordinary activists and journalists were tracking the scheme, exposing it even as it was unfolding. In 1941 the U.S. Department of Justice finally made a frontal attack, identifying the key plotters, finding their backers, and prosecuting dozens in federal court.\n\nNone of it went as planned.\n\nWhile the scheme has been remembered in history--if at all--as the work of fringe players, in reality it involved a large number of some of the country's most influential elected officials. Their interference in law enforcement efforts against the plot is a dark story of the rule of law bending and then breaking under the weight of political intimidation.\n\nThat failure of the legal system had consequences. The tentacles of that unslain beast have reached forward into our history for decades. But the heroic efforts of the activists, journalists, prosecutors, and regular citizens who sought to expose the insurrectionists also make for a deeply resonant, deeply relevant tale in our own disquieting times.",
    "BISAC_Categories": [
      "United States - 20th Century",
      "Political Process - Political Parties",
      "Political Ideologies - Conservatism & Liberalism"
    ],
    "About_Author": "Rachel Maddow is host of the Emmy Award-winning Rachel Maddow Show on MSNBC, as well as the #1 New York Times bestselling author of Drift and Blowout, and the New York Times bestselling co-author of Bag Man. Maddow received a bachelor's degree in public policy from Stanford University and earned her doctorate in political science at Oxford University. She lives in New York City and Massachusetts with her partner, artist Susan Mikula.",
    "Reviews": [
      "Praise for Prequel",
      "",
      "\"Maddow's book is a ripping read--well rendered, fast-paced and delivered with the same punch and assurance that she brings to a broadcast. . . . Prequel is a valuable window into the authoritarian mind-set--and the process by which self-professed patriots turn against democracy . . . the parallels to the present day are strong, even startling . . .\"--The New York Times",
      "",
      "\"[A] vivid, urgent, smart history,\" and \"Maddow makes a vital contribution to the history of armed fascism in the United States.\"--The Washington Post",
      "",
      "\"Maddow's sublime research into the precursors of current existential threats is astonishingly deep. She finds rabbit holes even rabbits are unaware of.\"--Booklist, starred review",
      "",
      "\"America beat fascism once. Maddow's timely study of enemies on the homefront urges that we can do so again.\"--Kirkus, starred reviews",
      "",
      "",
      "Praise for Blowout",
      "",
      "\"An account of international intrigue, high finance, low characters, and outrageous legal and illegal acts that put the global economy and Western democracy at grave risk. . . . [Maddow] tells this tale deliberately and methodically, building her case not as a cable commentator, but as a Rhodes Scholar.\"--The Boston Globe",
      "",
      "\"Blowout is a rollickingly well-written book, filled with fascinating, exciting and alarming stories about the impact of the oil and gas industry on the world today. . . . A brilliant description of many of the problems caused by our reliance on fossil fuels.\"--The New York Times Book Review",
      "",
      "\"I can't stress enough what a great storyteller Rachel Maddow is. [She carries] the reader through some hair-raising journalism in such an engaging and propulsive fashion you simply cannot put the book down. . . . It has left a most lasting impression.\"--San Francisco Chronicle"
    ]
  },
  {
    "Author": "Jim Kwik ",
    "Book_Name": "Limitless Expanded Edition: Upgrade Your Brain, Learn Anything Faster, and Unlock Your Exceptional Life",
    "Book_Image": "https://images-us.bookshop.org/ingram/9781401968717.jpg?height=500&v=v2-8fc43611993f93a8d655064c4a1bd45c",
    "Product_Details": [
      {
        "Availability_Status": "InStock",
        "Price": [
          {
            "Primary_Price": "$28.99 ",
            "Discounted_Price": "$26.96"
          }
        ],
        "Publisher": "Hay House",
        "Date_Published": "November 14, 2023",
        "Pages": "448",
        "Dimensions": "6.0 X 9.1 X 1.5 inches | 1.66 pounds",
        "Language": "English",
        "Format": "Hardcover",
        "EAN_UPC_Code": "9781401968717"
      }
    ],
    "Description": "rand-new tools to unlock your brain's potential! This expanded edition of the New York Times and #1 Wall Street Journal bestseller includes chapters on A.I., nootropics, discovering your brain type, and more.\n\nFor over 30 years, Jim Kwik, the world-renowned brain coach, has been the secret weapon of success for a diverse range of high achievers, including actors, athletes, CEOs, and business pioneers. In Limitless, he reveals science-based practices and field-tested tips to accelerate self-learning, communication, memory, focus, recall, and speed reading to create amazing results.\n\nIn this expanded edition, you'll find four new chapters:\n\nHow to harness A.I. (Artificial Intelligence) to boost H.I. (Human Intelligence)\nThe latest breakthroughs in nootropics and nutrition to enhance cognitive performance\nLimitless at Work-tools to adapt and thrive, whether you're fully remote, embracing the hybrid model, or resuming the traditional office setting\nA self-assessment to crack your \"brain animal\" code\n\nNewly updated with transformative success stories from people who've used Jim's teaching in the real world, the expanded edition of Limitless gives people the ability to accomplish more--more productivity, more transformation, more personal success, more business achievement--by changing their Mindset, Motivation, and Methods and creating unstoppable Momentum. These \"4 M's\" live in the pages of Limitless along with practical techniques that unlock the superpowers of your brain and change your habits.\n\nLearn how to:\n\nFLIP YOUR MINDSET - Identify and challenge the assumptions, habits, and procrastinations that limit you and expand the boundaries of what you believe is possible.\n\n\nIGNITE YOUR MOTIVATION - Uncovering what motivates you is the key that opens up limitless mental capacity. When you unleash your passions, purposes, and sources of energy, you stay focused and clear on your goals.\n\n\nMASTER THE METHODS - Accelerate learning, improve memory, and enhance brain performance. Jim Kwik applies the latest neuroscience for accelerated learning so you can finish a book 3x faster through speed reading (and remember it), learn a new language in record time, and master new skills with ease.\n\n\nBUILD MOMENTUM - Unstoppable momentum is the product of mindset, motivation, and methods. Jim offers new insights and tools to unlock the first 3 M's so you can become truly limitless.\n\nLimitless Expanded Edition is the ultimate brain training book, packed with practical techniques to help you level up your mental performance and transform your life.\n\n\"There's no genius pill, but Jim gives you the process for unlocking your best brain and brightest future.\" -- Mark Hyman, M.D.",
    "BISAC_Categories": [
      "Personal Success",
      "Motivational & Inspirational",
      "Personal Growth - Success",
      "Motivational"
    ],
    "About_Author": "JIM KWIK (his real name) is a widely recognized world expert in memory improvement, brain optimization, and accelerated learning. After a childhood brain injury left him with learning challenges, Kwik created strategies to dramatically enhance his mental performance. He has since dedicated his life to helping others unleash their brains' true potential. For more than 30 years, he has served as the brain coach to a who's who of Hollywood elite, professional athletes, political leaders, and business magnates, with corporate clients that include Google, Virgin, Nike, Zappos, SpaceX, GE, 20th Century Fox, Cleveland Clinic, WordPress, and such institutions as the United Nations, U.S. Air Force, Caltech, Harvard University, and Singularity University.\n\nThrough keynote speeches, he reaches in-person live audiences totaling over 200,000 every year; his online videos have garnered hundreds of millions of views. Kwik is regularly featured in media, including Forbes, HuffPost, Fast Company, Inc., Good Morning America, Entertainment Tonight, CNBC, and the cover of Entrepreneur magazine. He is the host of the acclaimed Kwik Brain podcast. KwikLearning.com's online courses are used by students in 195 countries.\n\nKwik, an advocate for brain health and global education, is also a philanthropist funding projects ranging from Alzheimer's research to the creation of schools from Guatemala to Kenya, providing health care, clean water, and learning for children in need. His mission: No brain left behind.\n\nJimKwik.com",
    "Reviews": [
      "\"Jim Kwik knows how to get the maximum out of me as a human being.\"",
      "-- Will Smith",
      "",
      "\"There's no genius pill, but Jim gives you the process for unlocking your best brain and brightest future.\"",
      "-- Mark Hyman, M.D., Head of Strategy and Innovation, Cleveland Clinic Center for Functional Medicine, 12-time New York Times best-selling author",
      "",
      "\" Jim Kwik makes us smarter! I know, because Jim taught me techniques to reframe how I understand my",
      "own limits and learn how to tap unused capacity in my brain.\"",
      "-- Simon Sinek, New York Times best-selling author of Infinite Game",
      "",
      "\"I've worked with onscreen superheroes throughout my career, and Jim's ability to level up your learning and life is one of the world's great superpowers. . . . Limitless is for any person or organization looking to unlock exceptional mental productivity and performance.\"",
      "-- Jim Gianopulos, Chairman and CEO, Paramount Pictures Corporation",
      "",
      "\"There's a whole science behind brain fitness, memory enhancement, and mental acuity, and Jim Kwik is the ultimate guide.\"",
      "-- Lisa Mosconi, Ph.D., Director of the Women's Brain Initiative, author of Brain Food and The XX Brain",
      "",
      "\"There is no one I trust more than Jim Kwik and his programs to optimize brain functioning.\"",
      "-- Dr. Daniel Amen, world's leading brain doctor, clinical neuroscientist, New York Times best-selling author",
      "",
      "\"As founder of the Women's Alzheimer's Movement, I'm keenly aware of how important it is to keep your mind and memory sharp. Jim Kwik's tools and techniques . . . are your brain's best friends.\"",
      "-- Maria Shriver, Emmy award-­winning journalist, founder of the Women's Alzheimer's Movement, New York Times best-selling author",
      "",
      "\"As a person who has quested for knowledge his entire life, I fully embrace what Jim Kwik has to teach . . . . When you learn how to learn, anything is possible, and Jim is the best in the world at showing you how.\"",
      "-- Quincy Jones, music producer, recipient of Grammy Living Legend",
      "",
      "\"Jim Kwik's Limitless is a revelation in learning how to learn.\"",
      "-- Dr. Rudy Tanzi, Alzheimer's disease researcher; Professor of Neurology, Harvard Medical School and MGH; best-selling author of Super Brain, Super Genes, and The Healing Self",
      "",
      "\"Our program with Jim on Mindvalley became the number one program of the year and in a study of almost 1,000 students, the average increase in reading speed was an astonishing 170 percent in just seven days of ten-minute-a-day lessons.\"",
      "-- Vishen Lakhiani, CEO of Mindvalley, New York Times best-selling author"
    ]
  },
  {
    "Author": "Robin Wall Kimmerer ",
    "Book_Name": "Braiding Sweetgrass: Indigenous Wisdom, Scientific Knowledge and the Teachings of Plants",
    "Book_Image": "https://images-us.bookshop.org/ingram/9781571313560.jpg?height=500&v=v2-42c6c6e6d60250383666edf501549788",
    "Product_Details": [
      {
        "Availability_Status": "InStock",
        "Price": [
          {
            "Primary_Price": "$20.00 ",
            "Discounted_Price": "$18.60"
          }
        ],
        "Publisher": "Milkweed Editions",
        "Date_Published": "August 11, 2015",
        "Pages": "408",
        "Dimensions": "5.4 X 8.4 X 1.0 inches | 1.15 pounds",
        "Language": "English",
        "Format": "Paperback",
        "EAN_UPC_Code": "9781571313560"
      },
      {
        "Availability_Status": "InStock",
        "Price": [
          {
            "Primary_Price": "$35.00 ",
            "Discounted_Price": "$32.55"
          }
        ],
        "Publisher": "Milkweed Editions",
        "Date_Published": "October 13, 2020",
        "Pages": "456",
        "Dimensions": "5.7 X 8.6 X 1.3 inches | 1.5 pounds",
        "Language": "English",
        "Format": "Hardcover",
        "EAN_UPC_Code": "9781571311771"
      },
      {
        "Availability_Status": "BackOrder",
        "Price": [
          {
            "Primary_Price": "$51.99 ",
            "Discounted_Price": "$48.35"
          }
        ],
        "Publisher": "Tantor Audio",
        "Date_Published": "July 05, 2016",
        "Pages": null,
        "Dimensions": "6.1 X 5.5 X 1.9 inches | 0.7 pounds",
        "Language": "English",
        "Format": "Compact Disc",
        "EAN_UPC_Code": "9781799983156"
      }
    ],
    "Description": " New York Times bestseller\nA Washington Post bestseller\nA Los Angeles Times bestseller\nNamed a \"Best Essay Collection of the Decade\" by Literary Hub\nA Book Riot \"Favorite Summer Read of 2020\"\nA Food Tank Fall 2020 Reading Recommendation\n\nAs a botanist, Robin Wall Kimmerer has been trained to ask questions of nature with the tools of science. As a member of the Citizen Potawatomi Nation, she embraces the notion that plants and animals are our oldest teachers. In Braiding Sweetgrass, Kimmerer brings these two lenses of knowledge together to take us on \"a journey that is every bit as mythic as it is scientific, as sacred as it is historical, as clever as it is wise\" (Elizabeth Gilbert).\n\nDrawing on her life as an indigenous scientist, and as a woman, Kimmerer shows how other living beings--asters and goldenrod, strawberries and squash, salamanders, algae, and sweetgrass--offer us gifts and lessons, even if we've forgotten how to hear their voices. In reflections that range from the creation of Turtle Island to the forces that threaten its flourishing today, she circles toward a central argument: that the awakening of ecological consciousness requires the acknowledgment and celebration of our reciprocal relationship with the rest of the living world. For only when we can hear the languages of other beings will we be capable of understanding the generosity of the earth, and learn to give our own gifts in return.",
    "BISAC_Categories": [
      "Ecology",
      "Essays",
      "Ethnic Studies - Native American Studies",
      "Plants - General",
      "Life Sciences - Botany",
      "Life Sciences - Ecology",
      "Philosophy & Social Aspects",
      "Anthropology - Cultural & Social"
    ],
    "About_Author": "Robin Wall Kimmerer is a mother, scientist, decorated professor, and enrolled member of the Citizen Potawatomi Nation. She is the author of the New York Times bestselling collection of essays Braiding Sweetgrass: Indigenous Wisdom, Scientific Knowledge and the Teachings of Plants as well as Gathering Moss: A Natural and Cultural History of Mosses. Kimmerer is a 2022 MacArthur Fellow. She lives in Syracuse, New York, where she is a SUNY Distinguished Teaching Professor of Environmental Biology, and the founder and director of the Center for Native Peoples and the Environment.",
    "Reviews": [
      "Praise for Braiding Sweetgrass",
      "",
      "\"Robin Wall Kimmerer is writer of rare grace. She writes about the natural world from a place of such abundant passion that one can never quite see the world the same way after having seen it through Kimmerer's eyes. In Braiding Sweetgrass, she takes us on a journey that is every bit as mythic as it is scientific, as sacred as it is historical, as clever as it is wise. She is a great teacher, and her words are a hymn of love to the world.\"--Elizabeth Gilbert",
      "",
      "\"Robin Wall Kimmerer has written an extraordinary book, showing how the factual, objective approach of science can be enriched by the ancient knowledge of the indigenous people. It is the way she captures beauty that I love the most--the images of giant cedars and wild strawberries, a forest in the rain and a meadow of fragrant sweetgrass will stay with you long after you read the last page.\"--Jane Goodall",
      "",
      "\"I give daily thanks for Robin Wall Kimmerer for being a font of endless knowledge, both mental and spiritual.\" --Richard Powers, New York Times",
      "",
      "\"Robin Wall Kimmerer opens a sense of wonder and humility for the intelligence in all kinds of life we are used to naming and imagining as inanimate.\"--Krista Tippett, host of On Being",
      "",
      "\"In a world where only six percent of mammalian biomass on the planet now comprises of wild animals, I longed for books that pressed me up against the inhuman, that connected me to an inhuman world. Braiding Sweetgrass by Robin Wall Kimmerer moved me to actual tears.\" --Alexandra Kleeman, The Millions",
      "",
      "\"In Braiding Sweetgrass, botanist Robin Wall Kimmerer tackles everything from sustainable agriculture to pond scum as a reflection of her Potawatomi heritage, which carries a stewardship 'which could not be taken by history: the knowing that we belonged to the land.' . . . It's a book absorbed with the unfolding of the world to observant eyes--that sense of discovery that draws us in.\" --NPR",
      "",
      "\"Professor and botanist Robin Wall Kimmerer knows that the answer to all forms of ecological unbalance have long been hidden in plain sight, told in the language of plants and animals, minerals and elements. She draws on her own heritage . . . pairing science with Indigenous principles and storytelling to advocate for a renewed connection between human beings and nature.\" --Outside",
      "",
      "\"Kimmerer eloquently makes the case that by observing and celebrating our reciprocal relationship with the natural world, one can gain greater ecological consciousness.\" --Sierra Magazine",
      "",
      "\"With deep compassion and graceful prose, Robin Wall Kimmerer encourages readers to consider the ways that our lives and language weave through the natural world. A mesmerizing storyteller, she shares legends from her Potawatomi ancestors to illustrate the culture of gratitude in which we all should live.\"--Publishers Weekly",
      "",
      "\"The gift of Robin Wall Kimmerer's book is that she provides readers the ability to see a very common world in uncommon ways, or, rather, in ways that have been commonly held but have recently been largely discarded. She puts forth the notion that we ought to be interacting in such a way that the land should be thankful for the people.\"--Minneapolis Star Tribune",
      "",
      "\"Braiding Sweetgrass is instructive poetry. Robin Wall Kimmerer has put the spiritual relationship that Chief Seattle called the 'web of life' into writing. Industrial societies lack the understanding of the interrelationships that bind all living things--this book fills that void. I encourage one and all to read these instructions.\"--Oren Lyons, Faithkeeper, Onondaga Nation and Indigenous Environmental Leader"
    ]
  },
  {
    "Author": "Shane Hawk ",
    "Book_Name": "Never Whistle at Night: An Indigenous Dark Fiction Anthology",
    "Book_Image": "https://images-us.bookshop.org/ingram/9780593468463.jpg?height=500&v=v2-34e3bf3dc8b642d9d5645977a94f847c",
    "Product_Details": [
      {
        "Availability_Status": "InStock",
        "Price": [
          {
            "Primary_Price": "$17.00 ",
            "Discounted_Price": "$15.81"
          }
        ],
        "Publisher": "Vintage",
        "Date_Published": "September 19, 2023",
        "Pages": "416",
        "Dimensions": "5.2 X 7.9 X 0.9 inches | 0.65 pounds",
        "Language": "English",
        "Format": "Paperback",
        "EAN_UPC_Code": "9780593468463"
      }
    ],
    "Description": "ATIONAL BESTSELLER - A bold, clever, and sublimely sinister collection that dares to ask the question: \"Are you ready to be un-settled?\"\n\n\"Never failed to surprise, delight, and shock.\" --Nick Cutter, author of The Troop and Little Heaven\n\nFeaturing stories by:\n\nNorris Black - Amber Blaeser-Wardzala - Phoenix Boudreau - Cherie Dimaline - Carson Faust - Kelli Jo Ford - Kate Hart - Shane Hawk - Brandon Hobson - Darcie Little Badger - Conley Lyons - Nick Medina - Tiffany Morris - Tommy Orange - Mona Susan Power - Marcie R. Rendon - Waubgeshig Rice - Rebecca Roanhorse - Andrea L. Rogers - Morgan Talty - D.H. Trujillo - Theodore C. Van Alst Jr. - Richard Van Camp - David Heska Wanbli Weiden - Royce Young Wolf - Mathilda Zeller\n\nMany Indigenous people believe that one should never whistle at night. This belief takes many forms: for instance, Native Hawaiians believe it summons the Hukai'po, the spirits of ancient warriors, and Native Mexicans say it calls Lechuza, a witch that can transform into an owl. But what all these legends hold in common is the certainty that whistling at night can cause evil spirits to appear--and even follow you home.\n\nThese wholly original and shiver-inducing tales introduce readers to ghosts, curses, hauntings, monstrous creatures, complex family legacies, desperate deeds, and chilling acts of revenge. Introduced and contextualized by bestselling author Stephen Graham Jones, these stories are a celebration of Indigenous peoples' survival and imagination, and a glorious reveling in all the things an ill-advised whistle might summon.",
    "BISAC_Categories": [
      "Horror - General",
      "Mystery & Detective - Collections & Anthologies",
      "Native American & Aboriginal"
    ],
    "About_Author": "SHANE HAWK (enrolled Cheyenne-Arapaho, Hidatsa and Potawatomi descent) is a history teacher by day and a horror writer by night. He entered the horror scene with his first publication, Anoka: A Collection of Indigenous Horror, in October 2020. He lives in San Diego with his beautiful wife, Tori. Learn more by visiting shanehawk.com.\n\nTHEODORE C. VAN ALST, JR. (enrolled member, Mackinac Bands of Chippewa and Ottawa Indians) is the author of the novel Sacred Smokes, winner of the Tillie Olsen Award for Creative Writing, and Sacred City, winner of the Electa Quinney Award for Published Stories. His Pushcart-nominated fiction has been published in Southwest Review, Unnerving Magazine, Red Earth Review, The Journal of Working-Class Studies, Massachusetts Review, The Raven Chronicles, and Yellow Medicine Review, among others. He is a professor and chair of Indigenous Nations Studies at Portland State University.",
    "Reviews": [
      "\"A revelation.\"",
      "--Ron Charles, The Washington Post",
      "",
      "\"[The editors'] taste is extraordinary, and they've put together a wonderful book. . . . Get this book because it showcases some truly exceptional writing. If you love short fiction, you really shouldn't miss it.\"",
      "--Arley Sorg, Lightspeed Magazine",
      "",
      "\"It's legit. . . . You don't want to miss this dark exploration of Indigenous traditions, themes, and characters.\"",
      "--Matthew Jackson, Paste, \"25 Horror Books We Can't Wait to Read This Fall\"",
      "",
      "\"A book of tantalizing tales that stretch from the eerie to the delightfully absurd. Some sound like they were plucked from David Lynch's own brain and others are so steeped in reality that one feels like evil doesn't have to follow one home because it is already there. . . . An unequivocal essential for any reader who isn't afraid of the dark.\"",
      "--Mallory Smart, Maudlin House",
      "",
      "\"Mining rich strata of poisoned history and blood-soaked land, the writers summon an exhaustive array of ghosts, wolves, Wendigo spirits, human eaters, conjure women, and petroglyphs willing to exact revenge if you scratch them with your car keys. Throughout the 26 stories, contemporary American life is a threadbare bandage soaked through with the gore of the wound it never truly covers or heals.\"",
      "--Alan Scherstuhl, Scientific American",
      "",
      "\"Editors Shane Hawk and Theodore C. Van Alst, Jr. prove themselves masters of flow throughout Never Whistle at Night. . . . A first-rate anthology. . . . This is truly a special book.\"",
      "--Christopher Shultz, Lit Reactor",
      "",
      "\"Scary and unsettling and sometimes outright horrifying. . . . These stories are wildly imaginative, frightening, and fun.\"",
      "--Liberty Hardy, Book Riot",
      "",
      "\"[These stories] demonstrate the impressive breadth and depth of Indigenous horror. . . . An excellent collection of varied tales that run the gamut from vengeful to wistful to hopeful.\"",
      "--The Gothic Library",
      "",
      "\"This collection gathers together a spine-chilling range of stories from many of the most exciting Indigenous literary voices, celebrating the power of Native imagination.\"",
      "--Eliza Browning, Electric Literature",
      "",
      "\"Never Whistle at Night should not be missed by anyone who considers themselves a horror fan. . . . A dark and personal look into what fears and otherworldly powers still hold sway over the landscape.\"",
      "--Ray Palen, Bookreporter",
      "",
      "\"A satisfying mix of unsettling horror stories written by an array of notable Native authors. . . . This volume is a must . . . and will be devoured by speculative fiction fans who enjoy a sprinkle of social commentary within their scary books.\"",
      "--Verónica N. Rodríguez, Booklist (starred review)",
      "",
      "\"A heavy-hitting arrangement of 26 twisted tales from established and emerging Indigenous North American authors. . . . Lifting up an exciting array of authors, this anthology will be a treat for horror fans.\"",
      "--Publishers Weekly",
      "",
      "\"Spine-tingling and suggestive storytelling. . . . Entertaining and thought-provoking, especially in its highlighting of the lurking terrors--from intergenerational trauma to environmental destruction to toxic allyship--confronting Indigenous peoples today.\"",
      "--Kirkus Reviews",
      "",
      "\"Quietly disturbing. . . . Shocking. . . . Sublime. . . . Capture readers' imaginations through inventive storytelling and raw emotion. . . . This anthology is perfect for those who've enjoyed Indigenous horror authors like Stephen Graham Jones.\"",
      "--James Gardner, Library Journal",
      "",
      "\"The stories in Never Whistle at Night go for broke and then keep on going. If it's over the top horror you want, you'll find it. If subtle and restrained scares are more to your taste, you find them, too. No matter the story, though, you're in for fierce, fine writing that leaves its mark deep in the folds of your brain. Shane Hawk and Theodore Van Alst have put together a powerhouse of a book; I'm privileged to have read it.\"",
      "--John Langan, author of Corpsemouth and Other Autobiographies",
      "",
      "\"We recommend double-checking the locks before curling up with this book.\"",
      "--Jordan Snowden, Table Magazine",
      "",
      "\"Monsters wear many faces in these tales, and violence is both a cruelty and catharsis depending on who's wielding it, the balance of power shifting according to who's enforcing old patterns or carving new ones.\"",
      "--Natalie Zutter, Literary Hub",
      "",
      "\"Story to story, Never Whistle at Night never failed to surprise, delight, and shock me. I'm a big fan of stories that make you feel like you're standing at the edge of a cliff with a stranger's fingers on the tip of your spine--and this anthology has that ungoverned, go-for-broke aesthetic that I love.\"",
      "--Nick Cutter, author of Little Heaven",
      "",
      "\"Never Whistle at Night is all I've ever wanted in an Indigenous horror anthology. From doubles, to Empty People, to story theft, to zombies, this anthology explores the horror that lives in colonial violence, generational love and trauma, and our everyday lives. It's a joy to see such a diverse representation of experience, background, and style in this carefully-curated and terrifying collection.\"",
      "--Jessica Johns, author of Bad Cree",
      "",
      "\"This groundbreaking anthology showcases to the world that Indigenous horror has many faces, and these powerful stories are a horror lover's dream: each one singular and heartfelt, carving new storytelling pathways that feel both unique and universal, haunting and healing. It's impossible to guess what's coming next, and that unpredictability is so central to why horror is such a powerful genre as we all confront life's terrors.\"",
      "--Tananarive Due, author of The Reformatory",
      "",
      "\"I've increasingly come to suspect that the best work in contemporary Horror is being written by Indigenous writers, and Never Whistle at Night makes me certain of this. Consisting of more than two dozen stories by turns fierce and strange--sometimes about storytelling, sometimes political, sometimes just very, very unsettling--this is a deeply satisfying anthology.\"",
      "--Brian Evenson, author of The Glassy, Burning Floor of Hell",
      "",
      "\"The combination of folklore and the travails of contemporary life is potent. Hard-edged and dread-inducing, Never Whistle at Night showcases major horror talent.\"",
      "--Laird Barron, author of The Wind Began to Howl",
      "",
      "\"An extensive collection of Indigenous stories ranging from the humorous to the terrifying, this anthology is a must-read for everyone. Your new favorite author is absolutely in this book.\"",
      "--Amina Akhtar, author of Kismet",
      "",
      "\"Melodious, haunting, and visceral, Never Whistle at Night enchants from the very start with fiery confidence and merciless ghosts. These are stories that dig their fingers inside you and carve something truly special. An absolute must-read.\"",
      "--Hailey Piper, Bram Stoker Award-winning author of Queen of Teeth",
      "",
      "\"Can you draw power from the spirit of a story? If the twenty-six tales in the essential Never Whistle at Night anthology are any indication, the answer is an emphatic yes. The title itself provides its own warning, but I'll go one step further: Never read this collection of spine-chilling stories alone at night. You just might not make it to morning.\"",
      "--Clay McLeod Chapman, author of Ghost Eaters"
    ]
  },
  {
    "Author": "Martha Wells ",
    "Book_Name": "System Collapse",
    "Book_Image": "https://images-us.bookshop.org/ingram/9781250826978.jpg?height=500&v=v2-d66aa493d3c935aa91290e915828f09b",
    "Product_Details": [
      {
        "Availability_Status": "InStock",
        "Price": [
          {
            "Primary_Price": "$21.99 ",
            "Discounted_Price": "$20.45"
          }
        ],
        "Publisher": "Tordotcom",
        "Date_Published": "November 14, 2023",
        "Pages": "256",
        "Dimensions": "5.35 X 8.3 X 0.69 inches | 0.67 pounds",
        "Language": "English",
        "Format": "Hardcover",
        "EAN_UPC_Code": "9781250826978"
      }
    ],
    "Description": "Everyone's favorite lethal SecUnit is back in the next installment in Martha Wells's New York Times bestselling Murderbot Diaries series.\n\nAm I making it worse? I think I'm making it worse.\n\nFollowing the events in Network Effect, the Barish-Estranza corporation has sent rescue ships to a newly-colonized planet in peril, as well as additional SecUnits. But if there's an ethical corporation out there, Murderbot has yet to find it, and if Barish-Estranza can't have the planet, they're sure as hell not leaving without something. If that something just happens to be an entire colony of humans, well, a free workforce is a decent runner-up prize.\n\nBut there's something wrong with Murderbot; it isn't running within normal operational parameters. ART's crew and the humans from Preservation are doing everything they can to protect the colonists, but with Barish-Estranza's SecUnit-heavy persuasion teams, they're going to have to hope Murderbot figures out what's wrong with itself, and fast!\n\nYeah, this plan is... not going to work.\n\nThe Murderbot Diaries\nAll Systems Red\nArtificial Condition\nRogue Protocol\nExit Strategy\nNetwork Effect\nFugitive Telemetry\nSystem Collapse",
    "BISAC_Categories": [
      "Science Fiction - Action & Adventure",
      "Science Fiction - Crime & Mystery"
    ],
    "About_Author": "MARTHA WELLS has written many novels, including the million-selling New York Times and USA Today-bestselling Murderbot Diaries series, which has won multiple Hugo, Nebula, Locus, and Alex Awards. Other titles include Witch King, City of Bones, The Wizard Hunters, Wheel of the Infinite, the Books of the Raksura series (beginning with The Cloud Roads and ending with The Harbors of the Sun), and the Nebula-nominated The Death of the Necromancer, as well as YA fantasy novels, short stories, and nonfict",
    "Reviews": [
      "An Indie Next Pick!",
      "",
      "A LibraryReads Hall of Fame Pick!",
      "",
      "\"Readers won't miss the wall-to-wall action that defined the series from its beginning. The characters and the world building remain engrossing and rewarding.\" --Booklist, starred review",
      "",
      "Praise for The Murderbot Diaries",
      "",
      "\"I love Murderbot!\" --Ann Leckie",
      "",
      "\"The most heartwarming action-packed literally explosive space opera I've enjoyed in a long time. Martha Wells is the best writer of loveable snarky gender-subversive killing machines out there!\" --N. K. Jemisin",
      "",
      "\"We are all a little bit Murderbot.\"--NPR",
      "",
      "\"I might have a little bit of a thing for a robot. Its name is Murderbot... Network Effect [is] great.\" --Wired",
      "",
      "\"I can think of no better company than this paranoid android.\" --The New Scientist",
      "",
      "\"Murderbot, with its on-point observations and addictive interior monologues, is easily one of my favorite characters in SF... Highly recommended.\" --Charles de Lint for Fantasy & Science Fiction",
      "",
      "\"I could read about Murderbot all week.\" --Locus"
    ]
  },
  {
    "Author": "Rebecca Yarros ",
    "Book_Name": "Fourth Wing",
    "Book_Image": "https://images-us.bookshop.org/ingram/9781649374042.jpg?height=500&v=v2-8b97120da15945de50e0eadd00000000",
    "Product_Details": [
      {
        "Availability_Status": "InStock",
        "Price": [
          {
            "Primary_Price": "$29.99 ",
            "Discounted_Price": "$27.89"
          }
        ],
        "Publisher": "Entangled: Red Tower Books",
        "Date_Published": "May 02, 2023",
        "Pages": "528",
        "Dimensions": "6.3 X 9.1 X 1.8 inches | 1.5 pounds",
        "Language": "English",
        "Format": "Hardcover",
        "EAN_UPC_Code": "9781649374042"
      }
    ],
    "Description": "An Instant New York Times Bestseller\nA Goodreads Most Anticipated Book\n\n\"Suspenseful, sexy, and with incredibly entertaining storytelling, the first in Yarros' Empyrean series will delight fans of romantic, adventure-filled fantasy.\" --Booklist, starred review\n\n\"Fourth Wing will have your heart pounding from beginning to end... A fantasy like you've never read before.\" ―#1 New York Times bestselling author Jennifer L. Armentrout\n\nEnter the brutal and elite world of a war college for dragon riders from New York Times bestselling author Rebecca Yarros\n\nTwenty-year-old Violet Sorrengail was supposed to enter the Scribe Quadrant, living a quiet life among books and history. Now, the commanding general--also known as her tough-as-talons mother--has ordered Violet to join the hundreds of candidates striving to become the elite of Navarre: dragon riders.\n\nBut when you're smaller than everyone else and your body is brittle, death is only a heartbeat away...because dragons don't bond to \"fragile\" humans. They incinerate them.\n\nWith fewer dragons willing to bond than cadets, most would kill Violet to better their own chances of success. The rest would kill her just for being her mother's daughter--like Xaden Riorson, the most powerful and ruthless wingleader in the Riders Quadrant.\n\nShe'll need every edge her wits can give her just to see the next sunrise.\n\nYet, with every day that passes, the war outside grows more deadly, the kingdom's protective wards are failing, and the death toll continues to rise. Even worse, Violet begins to suspect leadership is hiding a terrible secret.\n\nFriends, enemies, lovers. Everyone at Basgiath War College has an agenda--because once you enter, there are only two ways out: graduate or die.\n\nThe Empyrean series is best enjoyed in order.\nReading Order:\nBook #1 Fourth Wing\nBook #2 Iron Flame",
    "BISAC_Categories": [
      "Fantasy - Epic",
      "Fantasy - Romantic"
    ],
    "About_Author": "Rebecca Yarros is the New York Times bestselling author of more than fifteen novels, with multiple starred Publishers Weekly reviews and a Kirkus Best Book of the Year. A second-generation army brat, Rebecca loves military heroes and has been blissfully married to hers for more than twenty years. She's the mother of six children, and she and her family live in Colorado with their stubborn English bulldogs, two feisty chinchillas, and a cat named Artemis, who rules them all.\n\nHaving fostered, then adopted their youngest daughter, Rebecca is passionate about helping children in the foster system through her nonprofit, One October, which she cofounded with her husband in 2019. To learn more about their mission, visit oneoctober.org.\n\nTo catch up on Rebecca's latest releases and upcoming novels, visit RebeccaYarros.com.",
    "Reviews": [
      "\"A fantasy like you've never read before.\" --Jennifer L. Armentrout, #1 New York Times bestselling author",
      "",
      "\"Smart-ass. Bad-ass. Kick-ass. One helluva ride!\" --Tracy Wolff, #1 New York Times bestselling author",
      "",
      "\"Utterly addictive and completely unputdownable. I devoured every page and fell hopelessly, desperately in love with these characters and the incredible world Rebecca Yarros has so carefully, lovingly crafted. Hands down the best book hangover I've ever experienced. I can't wait for more!\" --Helena Hunting, New York Times bestselling author",
      "",
      "\"An exhilarating dragon ride of a fantasy! Brutal, fast-paced, compelling, and simmering with romantic tension that left me on the edge of my seat. Fourth Wing is everything I want in a book and more. Phenomenal! Move this one to the top of your TBR.\" --Samantha Young, New York Times and USA Today bestselling author",
      "",
      "\"Buckle up because with nonstop action, sizzling romance, and the BEST DRAGONS EVER, you will not be able to put down Fourth Wing until the last page is turned. It's a wild, sexy, roller coaster of a ride.\" --Mary E. Pearson, New York Times bestselling author",
      "",
      "\"Dragons and war, passion and power...Fourth Wing is dazzling. Rebecca Yarros has created a world as compelling as it is deadly, and I can't wait to see where she takes it next.\" --Nalini Singh, New York Times bestselling author",
      "",
      "\"This book should come with a warning label, because once you start it, you won't stop until you reach the final page. Forbidden romance that simmers off the page; relentless, heart-stopping action; and a delicious, morally gray hero--this is the book I've been waiting for!\" --Geneva Lee, New York Times bestselling author",
      "",
      "\"Fourth Wing is an unforgettable adventure from cover to cover. I cheered, laughed, grinned, and refused to put it down. This expertly crafted romantic fantasy is sure to launch the beginning of a brand-new insatiable fandom!\" --Lexi Ryan, #1 New York Times bestselling author",
      "",
      "\"Kapow, what a story! In Fourth Wing, Rebecca Yarros gives you gutsy young heroines and sexy bad boys living in a world where no one--not even the mightiest dragon--is safe. This is some sharp, bold, and delicious storytelling!\" --Rachel Howzell Hall, New York Times bestselling author",
      "",
      "\"House of the Dragon meets Divergent in this utterly thrilling, unputdownable new fantasy! Fourth Wing is full of scintillating adventure, soaring dragon flight, and slow-burn, enemies-to-lovers romance. Climb on and enjoy the ride!\" --Amalie Howard, USA Today bestselling author",
      "",
      "\"As smoldering as it is spellbinding, Fourth Wing is a thrilling, dragon-filled delight!\" --Cindi Madsen, USA Today bestselling author",
      "",
      "\"Rebecca Yarros's Fourth Wing kept me up at night whispering \"one more chapter\" until suddenly the sun was rising--and even then I still couldn't bring myself to stop. Utterly immersive, fiercely romantic, and unforgivably addictive, this book is a spectacular masterpiece and my new fantasy obsession.\" --Lynette Noni, Australia's #1 young adult fiction author",
      "",
      "\"An expertly woven tale in a riveting world of dragons, life-or-death competition, and betrayal, Rebecca Yarros hits all the high notes and delivers a thrilling new romantic fantasy that readers will devour.\" --K.A. Tucker, international bestselling author"
    ]
  },
  {
    "Author": "Susan H. Herman ",
    "Book_Name": "Stories of Faith: Carmichael Presbyterian Church at 100",
    "Book_Image": "https://images-us.bookshop.org/ingram/9798988028901.jpg?height=500&v=v2",
    "Product_Details": [
      {
        "Availability_Status": "InStock",
        "Price": [
          {
            "Primary_Price": "$14.99",
            "Discounted_Price": null
          }
        ],
        "Publisher": "Carmichael Presbyterian Church",
        "Date_Published": "November 01, 2023",
        "Pages": "344",
        "Dimensions": "6.0 X 9.0 X 0.72 inches | 1.01 pounds",
        "Language": "English",
        "Format": "Paperback",
        "EAN_UPC_Code": "9798988028901"
      }
    ],
    "Description": "Carmichael Presbyterian Church (CPC) was founded in 1923. It was the first church to be established in the Northern California farming community of Carmichael Colony. Now an inner-ring suburb of Sacramento, Carmichael still has pockets of citrus and olive groves, horse properties, and beautiful views of the American River. It is also an urbanized area where many struggle with food and housing insecurity. The social mission of CPC has been the main theme in its story from the very beginning, and today the church dedicates much of its energy on food and hospitality-related ministries.\n\n\n\n\nStories of Faith is a follow-up to Heritage of Faith: A 75-Year History of Carmichael Presbyterian Church, which was published in 1998. As such, this book emphasizes the most recent twenty-five years in the church's history (1998-2023). It also reaches back farther, when needed, to show how various features of the church today are connected to important threads of its longer history. The chapter structure follows the church's mission statement: \"Responding to God's love through Jesus Christ, we welcome all, nurture relationships, grow in faith together, and connect with and serve our community and the world.\"\n\n\n\n\nReaders of this book are invited to reflect on the story of their own faith community, whether CPC or another congregation, and ponder what they find most worthy of celebration. They are also challenged to identify areas where they feel called to pray, discern, or deepen their own commitment.",
    "BISAC_Categories": [
      "United States - State & Local - West (AK, CA, CO, HI, ID, MT, NV, UT, WY)",
      "Christianity - Presbyterian"
    ],
    "About_Author": null,
    "Reviews": null
  },
  {
    "Author": "Ned Blackhawk ",
    "Book_Name": "The Rediscovery of America: Native Peoples and the Unmaking of U.S. History",
    "Book_Image": "https://images-us.bookshop.org/ingram/9780300244052.jpg?height=500&v=v2-a7c3f69ad29e760433a13d061fce2113",
    "Product_Details": [
      {
        "Availability_Status": "InStock",
        "Price": [
          {
            "Primary_Price": "$35.00 ",
            "Discounted_Price": "$32.55"
          }
        ],
        "Publisher": "Yale University Press",
        "Date_Published": "April 25, 2023",
        "Pages": "616",
        "Dimensions": "6.45 X 9.5 X 1.55 inches | 2.34 pounds",
        "Language": "English",
        "Format": "Hardcover",
        "EAN_UPC_Code": "9780300244052"
      }
    ],
    "Description": "inalist for the 2023 National Book Award in Nonfiction - A National Bestseller\n\nA sweeping and overdue retelling of U.S. history that recognizes that Native Americans are essential to understanding the evolution of modern America\n\n\"Eloquent and comprehensive. . . . In the book's sweeping synthesis, standard flashpoints of U.S. history take on new meaning.\"--Kathleen DuVal, Wall Street Journal\n\n\"In accounts of American history, Indigenous peoples are often treated as largely incidental--either obstacles to be overcome or part of a narrative separate from the arc of nation-building. Blackhawk . . . [shows] that Native communities have, instead, been inseparable from the American story all along.\"--Washington Post Book World, \"Books to Read in 2023\"\n\nThe most enduring feature of U.S. history is the presence of Native Americans, yet most histories focus on Europeans and their descendants. This long practice of ignoring Indigenous history is changing, however, with a new generation of scholars insists that any full American history address the struggle, survival, and resurgence of American Indian nations. Indigenous history is essential to understanding the evolution of modern America.\n\nNed Blackhawk interweaves five centuries of Native and non-Native histories, from Spanish colonial exploration to the rise of Native American self-determination in the late twentieth century. In this transformative synthesis he shows that\n\n- European colonization in the 1600s was never a predetermined success;\n\n- Native nations helped shape England's crisis of empire;\n\n- the first shots of the American Revolution were prompted by Indian affairs in the interior;\n\n- California Indians targeted by federally funded militias were among the first casualties of the Civil War;\n\n- the Union victory forever recalibrated Native communities across the West;\n\n- twentieth-century reservation activists refashioned American law and policy.\n\nBlackhawk's retelling of U.S. history acknowledges the enduring power, agency, and survival of Indigenous peoples, yielding a truer account of the United States and revealing anew the varied meanings of America.",
    "BISAC_Categories": [
      "Native American",
      "United States - General",
      "Ethnic Studies - Native American Studies"
    ],
    "About_Author": "Ned Blackhawk (Western Shoshone) is the Howard R. Lamar Professor of History and American Studies at Yale University, where he is the faculty coordinator for the Yale Group for the Study of Native America. He is the author of Violence over the Land: Indians and Empires in the Early American West. He lives in New Haven, CT.",
    "Reviews": [
      "\"In accounts of American history, Indigenous peoples are often treated as largely incidental--either obstacles to be overcome or part of a narrative separate from the arc of nation-building. Blackhawk . . . challenges those minimalizations and exclusions, showing that Native communities have, instead, been inseparable from the American story all along.\"--Washington Post Book World, \"Books to Read in 2023\"",
      "",
      "\"Striking a masterful balance between the big picture and crystal-clear snapshots of key people and events, this is a vital new understanding of American history.\"--Publishers Weekly (starred review)",
      "",
      "\"A wide-ranging study that moves Indigenous peoples from the periphery to the core of continental history.\"--Kirkus Reviews",
      "",
      "\"Here we have a new foundation for history, showing how all aspects of America have been influenced by its complex Native-newcomer interface. . . . [Blackhawk's] elaborately documented accuracy satisfies beyond anything I've read in a career of teaching young children about American history.\"--Tim McCarthy, Boswell Book Company, Milwaukee, WI",
      "",
      "\"On his search to rediscover America, Blackhawk brilliantly rewrites U.S. history, illustrating that it cannot be told absent American Indians. This is the history text we have been waiting for.\"--Roxanne Dunbar-Ortiz, author of An Indigenous Peoples' History of the United States",
      "",
      "\"Richly told and deeply informed, The Rediscovery of America demonstrates the centrality of Indigenous Americans to U.S. history. Blackhawk shows that at every turn the enduring relations between natives and newcomers have shaped the course of the American republic.\"--Claudio Saunt, author of the National Book Award finalist Unworthy Republic",
      "",
      "\"Ranging across the continent and across the centuries, Ned Blackhawk skillfully interweaves American history and Native American history, demonstrating conclusively that we cannot properly understand one without the other.\"--Colin G. Calloway, Dartmouth College",
      "",
      "\"Refusing to tell simple stories of subordination or resistance, Ned Blackhawk shows how American politics, law, diplomacy, the economy, and popular culture become incomprehensible without a Native presence.\"--Richard White, Stanford University",
      "",
      "\"The Rediscovery of America is a testimony to the transformation of the field of American Indian history over the past several decades, and Blackhawk has abandoned the 'interpretive tools' of generations of American historians.\"--Brenda J. Child, University of Minnesota"
    ]
  },
  {
    "Author": "Nick Timiraos ",
    "Book_Name": "Trillion Dollar Triage: How Jay Powell and the Fed Battled a President and a Pandemic---And Prevented Economic Disaster",
    "Book_Image": "https://images-us.bookshop.org/ingram/9780316272810.jpg?height=500&v=v2-89978ebc9c91cf7b95e8be898c42748d",
    "Product_Details": [
      {
        "Availability_Status": "InStock",
        "Price": [
          {
            "Primary_Price": "$30.00 ",
            "Discounted_Price": "$27.90"
          }
        ],
        "Publisher": "Little Brown and Company",
        "Date_Published": "March 01, 2022",
        "Pages": "352",
        "Dimensions": "6.2 X 9.4 X 1.5 inches | 1.2 pounds",
        "Language": "English",
        "Format": "Hardcover",
        "EAN_UPC_Code": "9780316272810"
      },
      {
        "Availability_Status": "BackOrder",
        "Price": [
          {
            "Primary_Price": "$40.00 ",
            "Discounted_Price": "$37.20"
          }
        ],
        "Publisher": "Little Brown and Company",
        "Date_Published": "March 01, 2022",
        "Pages": null,
        "Dimensions": "5.91 X 5.67 X 1.18 inches | 1.1 pounds",
        "Language": "English",
        "Format": "Compact Disc",
        "EAN_UPC_Code": "9781668608371"
      }
    ],
    "Description": "The inside story, told with \"insight, perspective, and stellar reporting,\" of how an unassuming civil servant created trillions of dollars from thin air, combatted a public health crisis, and saved the American economy from a second Great Depression (Alan S. Blinder, former Vice Chair of the Federal Reserve).\n\nBy February 2020, the U.S. economic expansion had become the longest on record. Unemployment was plumbing half-century lows. Stock markets soared to new highs. One month later, the public health battle against a deadly virus had pushed the economy into the equivalent of a medically induced coma. America's workplaces--offices, shops, malls, and factories--shuttered. Many of the nation's largest employers and tens of thousands of small businesses faced ruin. Over 22 million American jobs were lost. The extreme uncertainty led to some of the largest daily drops ever in the stock market.\n\nNick Timiraos, the Wall Street Journal's chief economics correspondent, draws on extensive interviews to detail the tense meetings, late night phone calls, and crucial video conferences behind the largest, swiftest U.S. economic policy response since World War II. Trillion Dollar Triage goes inside the Federal Reserve, one of the country's most important and least understood institutions, to chronicle how its plainspoken chairman, Jay Powell, unleashed an unprecedented monetary barrage to keep the economy on life support. With the bleeding stemmed, the Fed faced a new challenge: How to nurture a recovery without unleashing an inflation-fueling, bubble-blowing money bomb?\n\nTrillion Dollar Triage is the definitive, gripping history of a creative and unprecedented battle to shield the American economy from the twin threats of a public health disaster and economic crisis. Economic theory and policy will never be the same.",
    "BISAC_Categories": [
      "Public Policy - Economic Policy",
      "Disasters & Disaster Relief",
      "Economic History"
    ],
    "About_Author": "Nick Timiraos is the chief economics correspondent for The Wall Street Journal, where he covers the Federal Reserve and U.S. economic policy. He joined the Journal in 2006 and previously wrote about the U.S. housing bust and the 2008 election. He is a graduate of Georgetown University and lives with his family in Washington, D.C.",
    "Reviews": null
  }
]